{
    "007bbfb7.json": "Input Description: In the input, you should see...3x3 grid with a colored pattern\n\nOutput Grid Size Description: The output grid size... output grid size is 9x9\n\nOutput Transformation Description: To make the output, you have to...create a black 9x9 grid. Copy the pattern of the input grid onto the output grid. However, the number of copies on the output grid is determined by the number of colored squares on the input grid. So if there are 3 colored squares on the input grid, you have to copy the pattern on the output grid 3 times. And if there are 5 colored squares on the input grid, you have to copy the pattern 5 times. The location of the copied pattern on the output grid also follows the location of each of the colored squares on the input grid.",
    "00d62c1b.json": "Input Description: In the input, you should see...green pixels in a random order, there should be some shapes that are totally surrounded by green pixels.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to...copy the input grid and then fill in all of the areas that are surrounded totally by green pixels.",
    "017c7c7b.json": "Input Description: In the input, you should see...colored grid in with black grid\n\nOutput Grid Size Description: The output grid size... change into 3x9\n\nOutput Transformation Description: To make the output, you have to...after change grid size use the same pattern but change the color into red, assume the design is in 3x9 grid",
    "025d127b.json": "Input Description: In the input, you should see...black background with colored shape\n\nOutput Grid Size Description: The output grid size...should stay the same\n\nOutput Transformation Description: To make the output, you have to...Copy input grid over. find the bottom of the shape. Go up to the next row with the multicolored blocks and move everything over one row. Everything except the bottom row and the block that connects to the bottom row on the right side will have shifted one block over to the left.",
    "045e512c.json": "Input Description: In the input, you should see... black background with one whole shape and other half-done shapes to its sides.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Then create the shapes that look like the whole shape starting from the given half-done shapes. Continue creating the same shape with the same size all the way to the end of the black background side.",
    "0520fde7.json": "Input Description: In the input, you should see...a grid divided into a left side and a right side by a line of grey blocks\n\nOutput Grid Size Description: The output grid size...the output grid is the size of one side only, excluding the grey blocks\n\nOutput Transformation Description: To make the output, you have to...imagine taking out the line grey blocks and sliding the left half over until it lines up with the right side. If two blue blocks are on top of each other the block becomes red, otherwise the block is black",
    "05269061.json": "Input Description: In the input, you should see...7 by 7 grid being different colored on black background\n\nOutput Grid Size Description: The output grid size...should be same as input size\n\nOutput Transformation Description: To make the output, you have to...fill the black grid with same pattern of row color, next row need to replace the same pattern of first row one column move shifted left",
    "05f2a901.json": "Input Description: In the input, you should see...a light blue cube and a red shape.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...keep the light blue cube in the same exact location. Then copy and move the other shape directly towards the blue cube, until it is touching it. At the end you'll have the light blue cube in the same exact spot as in the input grid and the the other shape will be the same but moved directly towards and touching the blue cube.",
    "06df4c85.json": "Input Description: In the input, you should see... different color pattern on black background\n\nOutput Grid Size Description: The output grid size...should be same as input size\n\nOutput Transformation Description: To make the output, you have to...fill the black 2x2 square grid with same color in between the two same color of 2x2 grid and connect",
    "08ed6ac7.json": "Input Description: In the input, you should see...a few bars that are gray\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to... change the color of the tallest to blue, then second talest to red,third tallest to green,then finally shortest to yellow for both pairs.",
    "09629e4f.json": "Input Description: In the input, you should see...a gray grid with random color cubes\n\nOutput Grid Size Description: The output grid size...stay the same\n\nOutput Transformation Description: To make the output, you have to...find space in grid that only have 4 colored cubes. Copy this small grid, but on the big grid, fill the entire 9x9 block with the cube colors and make the other colored cubes black, except the gray.",
    "0962bcdd.json": "Input Description: In the input, you should see...two plus sign shapes with a different center color\n\nOutput Grid Size Description: The output grid size... is the same as input\n\nOutput Transformation Description: To make the output, you have to...extend the plus sign one square in every direction and then make a 5x5 'X' of the center color through the center square. You should result in nine squares the color of the center and eight the color of the original plus sign.",
    "0a938d79.json": "Input Description: In the input, you should see....vertical blocks of different color pattern\n\nOutput Grid Size Description: The output grid size...it increase by 7 blocks\n\nOutput Transformation Description: To make the output, you have to...copy the input",
    "0b148d64.json": "Input Description: In the input, you should see... four colored area. One different from others.\n\nOutput Grid Size Description: The output grid size... become size of the different color area.\n\nOutput Transformation Description: To make the output, you have to... make it the area that is a different color.",
    "0ca9ddb6.json": "Input Description: In the input, you should see...grid with single pixel colored squares\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...copy image exactly.  Where there's a red square, put yellow squares at it's corners (4 total).  Where there's a dark blue square, put orange squares directly above and below it (4 total). Do nothing with light blue or magenta squares",
    "0d3d703e.json": "Input Description: In the input, you should see...a 3 by 3 grid with three different colored column.\n\nOutput Grid Size Description: The output grid size...is also 3 by 3.\n\nOutput Transformation Description: To make the output, you have to...change the column color to a specific other color. If the original color is dark red, change it to pink. If it is green, change it to yellow. If dark blue, change to grey. If light blue, change to dark red. The opposite is also true (for example if it is light blue, change to dark red).",
    "0dfd9992.json": "Input Description: In the input, you should see...a mostly filled in grid with a few black holes.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...start by copying the input grid exactly. Fill in all of the black boxes to complete the pattern until there are no more black boxes. To do this notice the pattern of the colored boxes. For example the top row might repeat every 4th row (or 5 rows or whatever the number of rows is before it repeats).  Once you've figured out the pattern just fill in the black boxes with the correct colored boxes. In the end you should see repeating patterns of colored boxes and there should be no black boxes in the grid.",
    "0e206a2e.json": "Input Description: In the input, you should see...a fully colored object and unfulfilled 3 color boxes with black backround.\n\nOutput Grid Size Description: The output grid size...is same as given\n\nOutput Transformation Description: To make the output, you have to...try to fill up the empty space between the three color boxes as the original object given.",
    "10fcaaa3.json": "Input Description: In the input, you should see... a few colored squares on a black background\n\nOutput Grid Size Description: The output grid size... is double the height and width of the input grid\n\nOutput Transformation Description: To make the output, you have to... copy the input. Then, resize the output grid to be double the width and height. Then, copy the upper-left quadrant of your output grid (which is the same as the input grid) and paste it once in each quadrant of the output grid. You should have 4x as many colored squares in the output as in the input. Then, for each colored square in the output, do the following: add a light blue square 1 above and to the left, 1 above and to the right, 1 below and to the left, 1 below and to the right. Each light blue square should be diagonally touching the colored square, forming an X with the colored square in the center. Some of the X's might overlap or go off the screen. That is okay.",
    "11852cab.json": "Input Description: In the input, you should see...shapes with one color that is not complete the pattern\n\nOutput Grid Size Description: The output grid size...is the same as input\n\nOutput Transformation Description: To make the output, you have to...complete the pattern that is not there by color each side with the color that is not there to complete the pattern",
    "1190e5a7.json": "Input Description: In the input, you should see...a colored grid with vertical and horizontal lines\n\nOutput Grid Size Description: The output grid size...count the number of vertical lines and add 1 to find your width and count the number of horizontal lines and add 1 to find your height\n\nOutput Transformation Description: To make the output, you have to...once you have your grid size change the color of the grid to the color of the input grid not the lines",
    "137eaa0f.json": "Input Description: In the input, you should see...several color patterns that each contain a single gray square.\n\nOutput Grid Size Description: The output grid size...is 3x3.\n\nOutput Transformation Description: To make the output, you have to...move each pattern so that the gray square in each pattern occupies the center square of the output 3x3 grid.",
    "150deff5.json": "Input Description: In the input, you should see... a black 9x9 grid with a gray pattern.\n\nOutput Grid Size Description: The output grid size... is the same for input and output\n\nOutput Transformation Description: To make the output, you have to... copy pattern and change 2x2 areas to light blue and 1x3 to red.",
    "178fcbfb.json": "Input Description: In the input, you should see...a grid with red, blue, and green squares\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...draw a vertical red line of squares through any red squares, then make left to right green lines through green squares and left to right blue lines through blue squares. Go over any red squares from before.",
    "1a07d186.json": "Input Description: In the input, you should see...one or two main colors with a third that is different than the rest.\n\nOutput Grid Size Description: The output grid size...remains the same\n\nOutput Transformation Description: To make the output, you have to...remove the different color that does not match the rest. move the single squares so they are in the same horizontal or vertical place depending if it is a vertical or horizontal line and have them touch the same side the single squares were on.",
    "1b2d62fb.json": "Input Description: In the input, you should see...two pattern with same grid size and a blue line in the middle.\n\nOutput Grid Size Description: The output grid size...the same size of the one pattern.\n\nOutput Transformation Description: To make the output, you have to...change the entire background in black and you have to watch the black space in both input pattern compare them now color the similar black space with light blue color.",
    "1b60fb0c.json": "Input Description: In the input, you should see...a three-part blue pattern against a black background.\n\nOutput Grid Size Description: The output grid size...should match the input.\n\nOutput Transformation Description: To make the output, you have to... recreate the blue pattern then add another part on the left, in red.",
    "1bfc4729.json": "Input Description: In the input, you should see...10x10 grid\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...use same color as input. 2 patterns, top and bottom; pattern like a long A stretch horizontally top then upside down on bottom of grid. To made the A and upside down A all side of grid are colored same color as the near color tile from input. Finally, add a 2 horizontal lines; 1 near top, 1 near bottom.",
    "1c786137.json": "Input Description: In the input, you should see...many colored squares with a section inside a rectangle of same colored squares\n\nOutput Grid Size Description: The output grid size...is the same size as the area of the squares inside of the same colored squares\n\nOutput Transformation Description: To make the output, you have to...copy the squares inside of the same colored squares",
    "1caeab9d.json": "Input Description: In the input, you should see... 3 shapes of blue, red, and yellow colors.\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...keep the blue shape where it is, and move the red and yellow shapes up or down so that they are at the same level as the blue-colored shape.",
    "1cf80156.json": "Input Description: In the input, you should see...a colored image on a black grid.\n\nOutput Grid Size Description: The output grid size...it becomes the size of the colored image.\n\nOutput Transformation Description: To make the output, you have to...you just need to make sure the colored image is exactly (top, bottom, left, right) in the new grid. No color change.",
    "1e0a9b12.json": "Input Description: In the input, you should see...varying colors on a black background\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...move each color block to the bottom, think like the game where you line up blocks to create lines to get point after point.",
    "1e32b0e9.json": "Input Description: In the input, you should see... a grid of one color with 9 5x5 spaces, some with shapes of another color.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...take what is in the up left space and put that pattern in all 9 spaces but in the same color as the grid. If a space has a pattern in it already, leave those blocks the same color as you fill in the rest of the first pattern around it in the grid color.",
    "1f0c79e5.json": "Input Description: In the input, you should see...a 2x2 colored object and one is orange.\n\nOutput Grid Size Description: The output grid size...should be the same as the input.\n\nOutput Transformation Description: To make the output, you have to...use the other color to extend based on the location of the oranged grid to the border. In the border, fill the one black grid with that color.",
    "1f642eb9.json": "Input Description: In the input, you should see... a light blue section surrounded by black, with colored squares scattered around the outside of the figure.\n\nOutput Grid Size Description: The output grid size... remains the same.\n\nOutput Transformation Description: To make the output, you have to... make one similiarly colored squar inside the light blue figure for each colored square around the exterior. Place the colored squares along the most outer edge of the blue figure, closest to their corresponding block.",
    "1f85a75f.json": "Input Description: In the input, you should see...a dense color block inside the big back ground\n\nOutput Grid Size Description: The output grid size...is the size of the small dense part\n\nOutput Transformation Description: To make the output, you have to...copy the small dense part",
    "1f876c06.json": "Input Description: In the input, you should see...various pairs of colored blocks in the grid.\n\nOutput Grid Size Description: The output grid size... is the same as the input size.\n\nOutput Transformation Description: To make the output, you have to...connect the two same colored blocks in a diagonal to create a same colored line.",
    "1fad071e.json": "Input Description: In the input, you should see...2x2 grid blue color\n\nOutput Grid Size Description: The output grid size...be 5x1 grid size\n\nOutput Transformation Description: To make the output, you have to...choose 5x1 grid size and fill the color of grid as blue as how many 2x2 blue color grid in input and leave others as black.",
    "2013d3e2.json": "Input Description: In the input, you should see... a colored shape on a black background\n\nOutput Grid Size Description: The output grid size... is 3x3\n\nOutput Transformation Description: To make the output, you have to... fill the grid with the upper left corner of the colored shape. The output should look like the top left corner of the colored shape.",
    "2204b7a8.json": "Input Description: In the input, you should see...two colored sides of the grid, with some colored blocks in the middle.\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...change the color of the block in the middle of the grid to match the color of the side they are closest to.",
    "22168020.json": "Input Description: In the input, you should see...a grid with one or more colored shapes that look a boxes with arms raised up\n\nOutput Grid Size Description: The output grid size...the grid size is the same\n\nOutput Transformation Description: To make the output, you have to...copy the input grid. Then close and fill in the shapes so that they look a little like weird triangles",
    "22233c11.json": "Input Description: In the input, you should see...diagonal green line(s)\n\nOutput Grid Size Description: The output grid size...remains the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...replicate the diagonal green line(s). At a perpendicular position of the green line(s), skip the number of squares which make the width of the green line, and place light blue squares equal in size to the width of the green line(s) on both sides of the green line(s).",
    "2281f1f4.json": "Input Description: In the input, you should see...grey squares on a black background\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...use the grey squares as reference to make red squares. The grey squares on the top are X, the grey squares on the right side are Y. Imagine a line that will intersect from X and Y squares. At that spot paint a black square red.",
    "228f6490.json": "Input Description: In the input, you should see...Grey squares with a hole in them, colored boxes that will fit, and some that will not.\n\nOutput Grid Size Description: The output grid size...it remains the same.\n\nOutput Transformation Description: To make the output, you have to...Take a colored shape to fill in the hole for each square. It will only take one shape per square.",
    "22eb0ac0.json": "Input Description: In the input, you should see...single pixels of different colors in two horizontal lines along the left and right sides of the grid.\n\nOutput Grid Size Description: The output grid size...stays the same size as the input.\n\nOutput Transformation Description: To make the output, you have to....copy the input. If two blocks across from each other are the same color, fill in the rest of that horizontal row with that color. Don't do anything with the blocks across from each other that are different colors",
    "234bbc79.json": "Input Description: In the input, you should see...a 11x3 grid with colored blocks end in a grey block\n\nOutput Grid Size Description: The output grid size...is 9x3 with the two empty all black column removed.\n\nOutput Transformation Description: To make the output, you have to...draw the image with the two removed columns.  Replace the color of the end grey blocks with the color of the original pattern leaving no grey blocks.",
    "23581191.json": "Input Description: In the input, you should see... two colored squares\n\nOutput Grid Size Description: The output grid size... is the same\n\nOutput Transformation Description: To make the output, you have to... continue both lines in their color both left to right and up and down. where the two lines cross each other make that square red",
    "239be575.json": "Input Description: In the input, you should see...Blue grid and two red squares with the random Black grid.\n\nOutput Grid Size Description: The output grid size...1 grid square.\n\nOutput Transformation Description: To make the output, you have to...make the color of the square the same color as the square that is five down and three across of the input.",
    "23b5c85d.json": "Input Description: In the input, you should see...grid with various patterns of small grid with different colors.\n\nOutput Grid Size Description: The output grid size...same as the small inner grid pattern.\n\nOutput Transformation Description: To make the output, you have to...copy the exact colors in the small inner grid pattern.",
    "253bf280.json": "Input Description: In the input, you should see...light blue dots\n\nOutput Grid Size Description: The output grid size...is the same as the old one\n\nOutput Transformation Description: To make the output, you have to...use green lines to connect blue dots that are in the same line",
    "25d487eb.json": "Input Description: In the input, you should see...a single pattern\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to...take the smaller color and shoot it out the top",
    "25d8a9c8.json": "Input Description: In the input, you should see...colored pattern in the grids.\n\nOutput Grid Size Description: The output grid size...same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to...fill the row with grey if the row has the same colors in the input. color the row with black if the row contain different colors.",
    "25ff71a9.json": "Input Description: In the input, you should see...3 by 3 grid blue color grid on black background\n\nOutput Grid Size Description: The output grid size...same as input size\n\nOutput Transformation Description: To make the output, you have to...move all the blue color move down  by one grid",
    "264363fd.json": "Input Description: In the input, you should see...large grid\n\nOutput Grid Size Description: The output grid size...input size grid\n\nOutput Transformation Description: To make the output, you have to...blocks tall and touch",
    "272f95fa.json": "Input Description: In the input, you should see...four lines - two horizontal, two vertical - in a single color on a black background.\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...copy the input. Fill the top row middle shape (between the lines) in red. For the second (center) row, fill the first shape with yellow, the middle with pink, and the last (right) in green. Then fill the middle shape of the bottom row with blue. The four corner shapes will still be black.",
    "27a28665.json": "Input Description: In the input, you should see...a 3 by 3 grid filled with different colored squares.\n\nOutput Grid Size Description: The output grid size...will change to a 1 by 1 square.\n\nOutput Transformation Description: To make the output, you have to...see which design you have. if you have two black lines that are 2 squares long, one coming down from the top left, and one going left from the bottom right, your output will be a green square.If you have a grey cross that is filled in, your output is a magenta square. If you have a black cross, with the middle square filled in with a different color, your output will be an orangey red. If you have a cross of a different color, with the middle square black, and the upper left square filled in with the color as well, then your output will be a blue square.",
    "28bf18c6.json": "Input Description: In the input, you should see...a figure on a big grid\n\nOutput Grid Size Description: The output grid size...3 up and 6 to the sides\n\nOutput Transformation Description: To make the output, you have to...copy the figure two times in that grid size.",
    "28e73c20.json": "Input Description: In the input, you should see...a black grid\n\nOutput Grid Size Description: The output grid size...is the same as input\n\nOutput Transformation Description: To make the output, you have to...create a green pattern. Start in the upper left and go right. Hit the corner and go down. Continue in clockwise order. When you hit green, stop one blocks away and continue in the pattern. End in the center.",
    "29623171.json": "Input Description: In the input, you should see...9 black boxes, with varying amounts of colored boxes inside of them\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...count the number of small colored boxes within the bigger black boxes, the one(s) with the most colored boxes get filled in entirely with that color. The remaining boxes are all black",
    "29c11459.json": "Input Description: In the input, you should see...5x11 grid\n\nOutput Grid Size Description: The output grid size...grid stay the same\n\nOutput Transformation Description: To make the output, you have to... move blue to the right to make 5 blue. move red to left to make 5 red. present with color square.",
    "29ec7d0e.json": "Input Description: In the input, you should see...Color fills of repeating colors by rows. Each row repeats the same pattern of colors rotating. Based on one square seperated by the blue line fills.\n\nOutput Grid Size Description: The output grid size...The grid size stays the same\n\nOutput Transformation Description: To make the output, you have to...You take the alternating squares of each grid and place those colors into the boxes consistantly. Fill those black spots with the color of square you choose.",
    "2bcee788.json": "Input Description: In the input, you should see...a large grid with two colored area patterns near the middle.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...The background is all green.  The object with the smaller number of blocks is not in the new image. The object with more blocks is placed in the same spaces in the new image.  A mirrored image of the object is placed right next to the original object on the same orientation.",
    "2bee17df.json": "Input Description: In the input, you should see...two different colors of squares around the edges of the grid.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...Copy the input grid into the output. Around the outside of the grid, you will notice some squares are only one square deep around. Take note of these squares. Using green, draw straight lines horizontally and vertically from these squares that are only one deep around the outside, connecting them ONLY to squares on the other side of the grid that also are only one square deep.",
    "2c608aff.json": "Input Description: In the input, you should see...a pattern with a central square and colored dots.\n\nOutput Grid Size Description: The output grid size...is the same as input\n\nOutput Transformation Description: To make the output, you have to...If the dots could connect to the central square with a straight line, connect it with the same color as the dot",
    "2dc579da.json": "Input Description: In the input, you should see... a grid broken up into 4 sections by a cross, where 1 section has an off-color single square in it.\n\nOutput Grid Size Description: The output grid size... is the size of 1 of the 4 sections.\n\nOutput Transformation Description: To make the output, you have to... \"zoom in\" on the section with an off-color square.",
    "2dd70a9a.json": "Input Description: In the input, you should see...a large grid with light blue dots as well as two red dots and two green dots\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...connect the green and red dots. Start by using green to fill in the dots until you hit a blue dot then change direction to the red dots. Continue until you hit the red dots.",
    "2dee498d.json": "Input Description: In the input, you should see...a pattern of colored blocks repeated several times from left to right in the grid.\n\nOutput Grid Size Description: The output grid size... is the size of one example of the colored block pattern.\n\nOutput Transformation Description: To make the output, you have to...zoom in on one example of the colored pattern and paste it into the grid of the correct size.",
    "31aa019c.json": "Input Description: In the input, you should see...a large grid with many colored blocks\n\nOutput Grid Size Description: The output grid size...is the same size\n\nOutput Transformation Description: To make the output, you have to....make the entire output grid black. then find the block in the input grid that is the only one of that color and place it in the same position in the output grid. Then surround that block with blocks of the bright red-orange color",
    "321b1fc6.json": "Input Description: In the input, you should see... a black grid with patterns placed thought it. One will be multi-colored, and the others will be a solid color.\n\nOutput Grid Size Description: The output grid size... Remains the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... REPLACE the solid colored patterns with the multi-colored versions, so each pattern has the same coloring. THEN REMOVE the original multi-colored pattern by replacing it entirely with black tiles.",
    "32597951.json": "Input Description: In the input, you should see... an incomplete rectangle or square\n\nOutput Grid Size Description: The output grid size...same as the input size\n\nOutput Transformation Description: To make the output, you have to...replace the blue squares with green squares to complete a square of a rectangle with the light blue blocks",
    "3345333e.json": "Input Description: In the input, you should see...a pattern of a single color with a box pattern of another color on top of it.\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...remove the box pattern color completely and make the other pattern symmetrical by mirroring the shape horizontally.",
    "3428a4f5.json": "Input Description: In the input, you should see...two patterns on top of one another with a line dividing them\n\nOutput Grid Size Description: The output grid size...size of one pattern\n\nOutput Transformation Description: To make the output, you have to...overlapping the two patterns, if the colors are the same then it is colored black. if they are different then they are colored in a different color",
    "3618c87e.json": "Input Description: In the input, you should see...gray grid with blue dots on top\n\nOutput Grid Size Description: The output grid size...is the same\n\nOutput Transformation Description: To make the output, you have to...take the blue dots and place them two squares down.with the background still fully black",
    "3631a71a.json": "Input Description: In the input, you should see...a large multicolored pattern that is symmetrical horizontally and vertically. The pattern has had large shapes placed on the pattern. The large shapes are a different color than the rest of the pattern.\n\nOutput Grid Size Description: The output grid size...is the same is the input grid.\n\nOutput Transformation Description: To make the output, you have to...replace the large shapes with the mirrored version of what is on the opposite side of the pattern.",
    "363442ee.json": "Input Description: In the input, you should see... a pattern on the left, a grey bar and blue squares on the right\n\nOutput Grid Size Description: The output grid size... is the same as the input\n\nOutput Transformation Description: To make the output, you have to... copy the pattern on the left and recreate the same pattern over each blue square on the right side, such that the center of the pattern is where the blue square was",
    "36d67576.json": "Input Description: In the input, you should see...Several different shapes\n\nOutput Grid Size Description: The output grid size...is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...make the shapes all the same shape - they will appear to be the same shape that is rotated in different degree.You will need to find what is common to each of the shapes and try to fill it in from there. It can also be a mirror of itself.",
    "36fdfd69.json": "Input Description: In the input, you should see... a grid with many squares in one color and a smaller number of squares in red.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Connect the red squares with yellow to create yellow and red rectangles or squares. Only connect red squares that are close together. Do not turn any black squares yellow - only connect red squares that you can connect by making the other color in the grid yellow. The output grid will have more than one yellow and red rectangle or square.",
    "3906de3d.json": "Input Description: In the input, you should see...a black grid with a blue pattern on top and red boxes toward the bottom.\n\nOutput Grid Size Description: The output grid size...is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...move the red boxes up into the blue pattern to fill the black spaces.",
    "39a8645d.json": "Input Description: In the input, you should see... a few different kinds of 3x3 shape. Each kind should have a unique shape and color. There may be multiple copies of each kind.\n\nOutput Grid Size Description: The output grid size... is 3x3\n\nOutput Transformation Description: To make the output, you have to... count the number of copies of each shape. Zoom in on the shape with the most copies.",
    "39e1d7f9.json": "Input Description: In the input, you should see...  a grid of pixel lines within the overall grid.\n\nOutput Grid Size Description: The output grid size... is the same size.\n\nOutput Transformation Description: To make the output, you have to.... Copy the input.  Identify a shape composed of a center color x surrounded by squares composed of color y.  Replicate the surrounding color y shape around every instance of color x squares.  Done.",
    "3aa6fb7a.json": "Input Description: In the input, you should see...3 blocks\n\nOutput Grid Size Description: The output grid size...4 blocks pattern\n\nOutput Transformation Description: To make the output, you have to...blue block add",
    "3ac3eb23.json": "Input Description: In the input, you should see...either one or two colored squares at the top of the grid. The rest should be all black.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...take each color and think of it as a 3 column checkerboard. For each color included, you need to go down and put that color in the opposite spot of the last row. For example, if the color is in the center on the first row, the second row would have color in column one and three. The next row would go back to color in column 2, and so on.",
    "3af2c5a8.json": "Input Description: In the input, you should see... a three by four grid with colored shapes\n\nOutput Grid Size Description: The output grid size... is a six by eight grid\n\nOutput Transformation Description: To make the output, you have to... place the input shape in the top left corner. Mirror the pattern from the input shape down and to the right, then fill in the bottom right to finish the mirror image.",
    "3bd67248.json": "Input Description: In the input, you should see... black background with a colored vertical line to the left\n\nOutput Grid Size Description: The output grid size... is identical.\n\nOutput Transformation Description: To make the output, you have to... you need to make a yellow line perpendicular to the line located at the left half and then you draw a diagonal red line starting at the intersecting between both lines.",
    "3bdb4ada.json": "Input Description: In the input, you should see...large rectangle shapes.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to...put black squares in the middle of the rectangle shapes so that the pattern is colored square, black square, colored square, black square and so on in the middle of each rectangle.",
    "3befdf3e.json": "Input Description: In the input, you should see...a square of one color filled with another color\n\nOutput Grid Size Description: The output grid size...stays the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...inverse the colors used in the original shape then add adjacent 4x2 shapes to the outer square on all four sides in the color of the new center square if it had a 2x2 center in the input, or a 3x1 shape on all four sides if the center had a 1x1 shape",
    "3c9b0459.json": "Input Description: In the input, you should see...colored blocks in a grid\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...rotate the grid 180 degrees clockwise. That's it. Just fill in the grid with the original colors as if the grid rotated twice to the right (180 degrees).",
    "3de23699.json": "Input Description: In the input, you should see...four colored squares that look like the corners of a box. Within this box is a shape colored with a different color. The background is black.\n\nOutput Grid Size Description: The output grid size...should be the size of what is inside the square made by the four colored squares. Copy everything inside.\n\nOutput Transformation Description: To make the output, you have to...change the color of the colored shape to the color of the four corner squares.",
    "3e980e27.json": "Input Description: In the input, you should see...a few red and green pixels. One green pixel and one red pixel will have other color pixels around them.\n\nOutput Grid Size Description: The output grid size...the same size as the input grid.\n\nOutput Transformation Description: To make the output, you have to...copy the placement and color of the pixels surrounding the red or green pixels that are not alone to the pixels that are alone. If the pixel is green the placement and color of the surrounding pixels should be the same as the surrounded green pixel. This should be applied to all solo green pixels. The same should be done with the red pixels, but the placement of the surrounding pixels should be mirrored horizontally.",
    "3eda0437.json": "Input Description: In the input, you should see...a grid with black, blue, and gray squares.\n\nOutput Grid Size Description: The output grid size...is similar.\n\nOutput Transformation Description: To make the output, you have to...examine the grid, find the black squares that will allow for a symmetrical shape of either a square or rectangle, and color those squares pink.",
    "3f7978a0.json": "Input Description: In the input, you should see... A random pattern of grey and light blue tiles\n\nOutput Grid Size Description: The output grid size... changes based on the size of the central pattern in the input grid\n\nOutput Transformation Description: To make the output, you have to... IDENTIFY the \"central\" pattern in the input grid. This is includes the two grey columns with light blue tiles at the top, AND EVERYTHING in-between those two columns. Create an output grid size to match the size of the central pattern, and fill it with that pattern. It's like taking a part of the input grid and enlarging it onto the output grid.",
    "40853293.json": "Input Description: In the input, you should see...squares of different colors\n\nOutput Grid Size Description: The output grid size...same size\n\nOutput Transformation Description: To make the output, you have to...connect similar colors with that color.  where they overlap you should use the vertical color",
    "4093f84a.json": "Input Description: In the input, you should see...gray rows with some other colored boxes in the grid.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...first copy the gray rows or columns exactly. Now imagine that the non-gray boxes are attracted to the gray rows like magnets. Move the non-gray boxes until they are touching the gray rows. Now, every box should be touching the gray rows. The last step is to change all of the non-gray boxes to be gray. The final result should be only gray boxes, all of them connected by the original gray rows/columns.",
    "41e4d17e.json": "Input Description: In the input, you should see...a light blue grid with blue square borders.\n\nOutput Grid Size Description: The output grid size...the same as the input.\n\nOutput Transformation Description: To make the output, you have to...find the center of each square and add a magenta pixel to its center. From that magenta pixel draw a line from each side of it (up, down, left, right) going straight to the border of the entire grid. Each magenta line must reach the border of the grid but the lines may NOT override the blue border of the square. The magenta lines are allowed to cross over each other.",
    "4258a5f9.json": "Input Description: In the input, you should see...a black grid with a number of grey boxes\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...surround each grey box with blue",
    "4290ef0e.json": "Input Description: In the input, you should see...many different colored blocks that are all in different square shapes that are not completely filled out.\n\nOutput Grid Size Description: The output grid size...should match the bigger square outline.\n\nOutput Transformation Description: To make the output, you have to...place the square outlines from large to small within each other. The square spaces that are not filled should remain the same as the background square colors.",
    "42a50994.json": "Input Description: In the input, you should see... s a grid with few colored patterns\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...find the single colored dots that  have not connect with others. you have to remove the dots that is not  connected with others and leave it as black.",
    "4347f46a.json": "Input Description: In the input, you should see...colored rectangular shapes on a black background\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...replace all colored blocks inside the rectangular shapes with black so there is only a colored outline of the shapes",
    "444801d8.json": "Input Description: In the input, you should see...corresponding\n\nOutput Grid Size Description: The output grid size...fill the color\n\nOutput Transformation Description: To make the output, you have to...same color change",
    "445eab21.json": "Input Description: In the input, you should see... grid\n\nOutput Grid Size Description: The output grid size...you will  order the size\n\nOutput Transformation Description: To make the output, you have to...fill with the color",
    "447fd412.json": "Input Description: In the input, you should see...two different colors. You will also see one complete pattern.\n\nOutput Grid Size Description: The output grid size...will be the same as input\n\nOutput Transformation Description: To make the output, you have to...If you have the same amount of other colored squares, simply copy the pattern. If you have more other color squares, copy the pattern but be sure to fill in more space",
    "44d8ac46.json": "Input Description: In the input, you should see...gray objects with the black area inside.\n\nOutput Grid Size Description: The output grid size...should be the same as the input\n\nOutput Transformation Description: To make the output, you have to...fill the black area within the gray with red if it is a square; otherwise, leave it alone.",
    "44f52bb0.json": "Input Description: In the input, you should see...a pattern of pink and black\n\nOutput Grid Size Description: The output grid size...change to one square\n\nOutput Transformation Description: To make the output, you have to...change it to either blue or orange",
    "4522001f.json": "Input Description: In the input, you should see...a 3x3 grid with a 2x2 green square in one corner with a red square\n\nOutput Grid Size Description: The output grid size... is 9x9\n\nOutput Transformation Description: To make the output, you have to...make grid 9x9. Note the diagonal that the red square is in in the input. The green square in the diagonal will indicate which corner in the output you should put a 4x4 green square in the output. The red square indicates which corner another 4x4 green square will touch it your new square in the output grid. So you will have two green 4x4 squares touching each other  corner to corner.",
    "4612dd53.json": "Input Description: In the input, you should see...A pattern with missing color in some squares\n\nOutput Grid Size Description: The output grid size...Copy the grid size\n\nOutput Transformation Description: To make the output, you have to...Fill in the black squares with red",
    "46442a0e.json": "Input Description: In the input, you should see... A grid with colored pixels.\n\nOutput Grid Size Description: The output grid size...  Is twice as large as the input, so a 2x2 becomes 4x4 and a 3x3 becomes 6x6 and so on.\n\nOutput Transformation Description: To make the output, you have to...  Create a grid twice the size of the input.  Divide the output grid into 4 quadrants.  Replicate the input grid pixels in the upper right quad.  In the upper left quad, place the input grid that's been rotated clockwise 90 degrees.  In the lower right quad, place the input grid colored pixels that has been rotated 180 degrees.  In the lower left quad place a copy of the input grid that's been rotated 90 degrees COUNTER-CLOCKWISE.  Done.",
    "469497ad.json": "Input Description: In the input, you should see... a colored square with colorful borders on the right and bottom side of the black 5x5 grid background.\n\nOutput Grid Size Description: The output grid size...the numbers of colors on the black background multiplied by 5\n\nOutput Transformation Description: To make the output, you have to... create the output grid, first identify how many colors there are on the black background, and multiply the number of colors by 5. So if you have 3 different colors, your grid will be 15x15 and if you have 2 different colors, your grid will be 10x10, and so on. Then multiply the colored square and the border by the number of colors and copy it onto the output grid so it will look like the input grid but in larger size.Finally, draw diagonal red lines out from each corner of the colored square to the edge of the black background.",
    "46f33fce.json": "Input Description: In the input, you should see...single colored squares throughout the grid.\n\nOutput Grid Size Description: The output grid size...doubles in size\n\nOutput Transformation Description: To make the output, you have to...for each color square you change them to a 4x4 block of that color.  You will remove black squares in between them so that when you have the 4x4 colors, the colors will be touching.  The colors should also start by touching the outside of the grid.",
    "47c1f68c.json": "Input Description: In the input, you should see... A colored cross that divides the grid into 4 smaller grids. In the top left smaller grid you should see a shape.\n\nOutput Grid Size Description: The output grid size... subtract 1 from each side. 4x4 becomes 3x3\n\nOutput Transformation Description: To make the output, you have to... Think of the new grid like the old grid with the divider removed. recreate the shape from the smaller top left grid of the input in the same color as the divider from the input. Mirror the shape in each of the remaining three quadrants along the x and y axis. for a total of 4 shapes in the same color. you are done.",
    "484b58aa.json": "Input Description: In the input, you should see...a background pattern that is not black.\n\nOutput Grid Size Description: The output grid size...remains the same\n\nOutput Transformation Description: To make the output, you have to...change all of the black areas to the colors in the background and match the background pattern.",
    "48d8fb45.json": "Input Description: In the input, you should see...same pattern\n\nOutput Grid Size Description: The output grid size...same pattern\n\nOutput Transformation Description: To make the output, you have to...same pattern",
    "4938f0c2.json": "Input Description: In the input, you should see...a design pattern\n\nOutput Grid Size Description: The output grid size... is similar\n\nOutput Transformation Description: To make the output, you have to...correlate the design until you have a pattern on all 4 corners of the cube",
    "496994bd.json": "Input Description: In the input, you should see... a pattern of two colors on the top of the grid.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... mirror the top pattern below.",
    "49d1d64f.json": "Input Description: In the input, you should see...colored blocks\n\nOutput Grid Size Description: The output grid size...add two blocks to height and width.\n\nOutput Transformation Description: To make the output, you have to...use the color from the input corner to make 4x4 blocks of the same colors in the corresponding corner of the output. Use colors in the middle outside blocks of the input grid to create 1x2 or 2x1 blocks in the corresponding middle outside space in the output. Black out each corner block of the output grid. If the output is not even in its number of blocks in height and width, black out the center of the grid.",
    "4be741c5.json": "Input Description: In the input, you should see...areas of 3 or 4 colors.\n\nOutput Grid Size Description: The output grid size...correspond with the vertical or horizontal orientation and the number of colors. For example, if there are 3 colors and they are separated horizontally, then the output would be a horizonal bar with 3 squares.\n\nOutput Transformation Description: To make the output, you have to...Take the first color, vertically or horizontally, then fill that color in the corresponding square in the output. Then the second and third...",
    "4c4377d9.json": "Input Description: In the input, you should see...two different colors of blocks.\n\nOutput Grid Size Description: The output grid size...should be 6x4.\n\nOutput Transformation Description: To make the output, you have to...you should use the input grid blocks and also mirror them to complete the output grid.",
    "4c5c2cf0.json": "Input Description: In the input, you should see...a colored x shape with another colored shape at one of its corners.\n\nOutput Grid Size Description: The output grid size...is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...mirror the shape at the corner of the x to the other corners of the x so that the x is surrounded by the corner shape.",
    "50846271.json": "Input Description: In the input, you should see...a lot of black and gray squares with 1-3 red patterns in different places throughout the grid\n\nOutput Grid Size Description: The output grid size...should be the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to... keep everything the same, but add blue squares around the red squares in order to create a row vertically and a row side to side that are overlapping and of the same range.",
    "508bd3b6.json": "Input Description: In the input, you should see...two to three red bars on either the top, bottom, left or right side and two to three light blue squares.\n\nOutput Grid Size Description: The output grid size...is the same.\n\nOutput Transformation Description: To make the output, you have to...you have to continue the direction the light blue squares are going until it reaches whatever the red spot it touches. Then it bounces off that spot and goes in that direction. Think of Pong. The line will always be diagonal, reach an edge of the grid and green except for the starting two or three spaces that are light blue.",
    "50cb2852.json": "Input Description: In the input, you should see...colored areas\n\nOutput Grid Size Description: The output grid size...the same\n\nOutput Transformation Description: To make the output, you have to...color the inside of each colored area with light blue.  Leave the outside of the colored shapes the example color one cube deep all the way around.",
    "5117e062.json": "Input Description: In the input, you should see...different shapes, one of which contain a light blue dot.\n\nOutput Grid Size Description: The output grid size...must match the size of the shape with the blue dot.\n\nOutput Transformation Description: To make the output, you have to...copy the shape with the light blue dot but replace the light blue dot with the shape color.",
    "5168d44c.json": "Input Description: In the input, you should see...A green 'track' line with a red 3x3 block on top of one of the 'tracks'.\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...If the pattern is vertical, move the red 3x3 block down one 'track'. If the pattern is horizontal, move the red 3x3 block one 'track' to the right. In both instances, only the location of the red blocks should change",
    "539a4f51.json": "Input Description: In the input, you should see...A vertical/horizontal pattern in differing colors.\n\nOutput Grid Size Description: The output grid size...10x10\n\nOutput Transformation Description: To make the output, you have to...replicate the pattern in the input box and continue repeating until all the boxes in your 10x10 grid have a color in them (no black around the outside edge). You're making the exact pattern, but miniaturized and repeating. Depending upon input, your pattern will repeat 2-6 times.",
    "53b68214.json": "Input Description: In the input, you should see...a certain color pattern on the black background\n\nOutput Grid Size Description: The output grid size...is 10x10\n\nOutput Transformation Description: To make the output, you have to...Copy the input pattern exactly and then just continue the pattern (using the same color) till you reach the end. It is just a continuation of the original.",
    "543a7ed5.json": "Input Description: In the input, you should see... pink squares on a blue background.\n\nOutput Grid Size Description: The output grid size... is the same size\n\nOutput Transformation Description: To make the output, you have to... outline any pink figure with green. Fill in blue inside pink figure with yellow.",
    "54d82841.json": "Input Description: In the input, you should see...one or two colored 3x3 shapes with the bottom middle colored black.\n\nOutput Grid Size Description: The output grid size...is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...add a yellow block on the bottom row of the grid under the black block in the colored shape/shapes.",
    "54d9e175.json": "Input Description: In the input, you should see...33x3 squares with gray lines between them\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...replace all 3x3 squares with a specific color. The color to replace is below:Green to Light BlueBlue to PurpleYellow to Dark RedRed to Orange",
    "5521c0d9.json": "Input Description: In the input, you should see...three colored objects.\n\nOutput Grid Size Description: The output grid size...is  the same.\n\nOutput Transformation Description: To make the output, you have to...decide how many rows the object has and move it up that same amount of rows.",
    "5582e5ca.json": "Input Description: In the input, you should see...a 3x3 grid with different colors in each square\n\nOutput Grid Size Description: The output grid size...is the same.\n\nOutput Transformation Description: To make the output, you have to...determine what color is used the most in the input grid and make the entire output grid that color.",
    "5614dbcf.json": "Input Description: In the input, you should see...a series of colored squares with random gray little squares included.\n\nOutput Grid Size Description: The output grid size...is reduced to 3x3 grid.\n\nOutput Transformation Description: To make the output, you have to...changed the colored squares in the input grid to a single square of the grid. So that an input grid 3x3 colored square is turned into a single filled square of the same color on the input grid. the same color",
    "56dc2b01.json": "Input Description: In the input, you should see...a green pattern and a red line on a black background.\n\nOutput Grid Size Description: The output grid size... should be the same as the input.\n\nOutput Transformation Description: To make the output, you have to...move the green pattern to be right next to the red line while staying the same exact pattern, then make a light blue line on the other side of the pattern the same way the red line is.",
    "56ff96f3.json": "Input Description: In the input, you should see...one or more pairs of same colors\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...take the colored as the starting and end point of the rectangle or square assume that the grid make rectangle or square",
    "57aa92db.json": "Input Description: In the input, you should see... 1 or 2 rectangular 2-color objects, and another 2-color object with a unique shape. All objects share one of their colors.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Then, \"apply\" the unique object's shape to the rectangular shape. Use the color that all the objects have in common to figure out the size. If the unique object has 1 block of the shared color, and the rectangular object has a 2x2 block of the shared color, then you will have to double the size of the shape to \"fit\" it to the rectangular shape. Each shape should maintain its color scheme.",
    "5ad4f10b.json": "Input Description: In the input, you should see...black background with colored pattern and another color 2 single squares\n\nOutput Grid Size Description: The output grid size... Will be 3x3\n\nOutput Transformation Description: To make the output, you have to...take the color pattern and move to new grid with color 2. The output pattern will be a smaller than the input.",
    "5bd6f4ac.json": "Input Description: In the input, you should see... you should see a large grid with many colored blocks\n\nOutput Grid Size Description: The output grid size...becomes much smaller\n\nOutput Transformation Description: To make the output, you have to...you only want the top right corner - the top third and right third of the grid",
    "5c0a986e.json": "Input Description: In the input, you should see...two 2x2 boxes red and blue\n\nOutput Grid Size Description: The output grid size...same as the input\n\nOutput Transformation Description: To make the output, you have to...create single line of boxes starting from the top left corner of the blue box all the way to the edge, same with red but starting at the bottom right",
    "5c2c9af4.json": "Input Description: In the input, you should see... three dots of one color\n\nOutput Grid Size Description: The output grid size... copy and paste the input\n\nOutput Transformation Description: To make the output, you have to... use the two outer dots to form a square around the dot in the middle, then continue making squares surrounding the last square you created until you can not make any more (do not stop when you can not get an entire square inside the black background, even if you have enough room to make one line and the rest of the square would be outside of the black background then make that line). The amount of black space between each box should be the same width as the first square you created (so if the first box width of 2, make them all a width of 2)",
    "5daaa586.json": "Input Description: In the input, you should see...four colored lines that form a square or rectangular shape.\n\nOutput Grid Size Description: The output grid size...is the size of this square created by the four lines\n\nOutput Transformation Description: To make the output, you have to...copy the inner square or rectangular shape to the input then fill in the middle from the color line that match the pixels already there, to the colored pixel. This can be up, down, left, or right, start from the colored edge and fill in to the pixel with the same color.",
    "60b61512.json": "Input Description: In the input, you should see...a 9x9 grid\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...complete the squares using the color orange.",
    "6150a2bd.json": "Input Description: In the input, you should see... a black grid with a colored shape\n\nOutput Grid Size Description: The output grid size... is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... rotate the whole grid two times. Imagine that the entire grid has been flipped vertically and horizontally.",
    "623ea044.json": "Input Description: In the input, you should see...one colored square\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...add squares on each of the four corners of the square all the way to the edge in the same color, should look like a sword",
    "62c24649.json": "Input Description: In the input, you should see... a 3x3 grid with red blue and green colors.\n\nOutput Grid Size Description: The output grid size...is 6x6\n\nOutput Transformation Description: To make the output, you have to...place the input grid in the top left 3x3. Then, reflect the top left 3x3 and place it in the top right 3x3. Now, reflect the top left and right 3x3 and place in the bottom left and right 3x3.",
    "63613498.json": "Input Description: In the input, you should see... a number of colored shapes including one with a grey border around it.\n\nOutput Grid Size Description: The output grid size... is the same as the input size.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Find any shapes outside of the border which are exactly the same shape and orientation as the shape inside of the grey border. Turn that shape grey. Do not change the colored shape inside the grey border or any shapes outside of the grey border which do not have the same orientation and shape as the one inside the border.",
    "6430c8c4.json": "Input Description: In the input, you should see...one 9x4 grid separated into two grids with a yellow set of horizontal boxes.\n\nOutput Grid Size Description: The output grid size...is the size of one of the two section, 4x4.\n\nOutput Transformation Description: To make the output, you have to...put the two section over top of each other. Then you have to look at each block.  A block that does not have any of the pattern from the old blocks is colored green.  Any block that has pattern from either of the first blocks is colored black.",
    "6455b5f5.json": "Input Description: In the input, you should see...vertical or horizontal lines of red squares.\n\nOutput Grid Size Description: The output grid size... is same as input size.\n\nOutput Transformation Description: To make the output, you have to...fill in the large black square shape with blue, make sure to fill only the small black squares. Then fill in the smallest black square shape with light blue. If there is more than one small black square shape that is the same size then then fill them also with light blue.",
    "662c240a.json": "Input Description: In the input, you should see... very well\n\nOutput Grid Size Description: The output grid size... by changing the numbers\n\nOutput Transformation Description: To make the output, you have to... read the instructions",
    "67385a82.json": "Input Description: In the input, you should see... black background with green colored blocks\n\nOutput Grid Size Description: The output grid size... copy the input grid\n\nOutput Transformation Description: To make the output, you have to... any green colored blocks that are more than 2 connected blocks (1x2, 2x1, 2x2, or other shapes) should be changed to light blue.",
    "673ef223.json": "Input Description: In the input, you should see...two red rectangle shapes on a black background, one on the left side and one on the right side. There is a number (one or many) light blue boxes located away from the top red rectangle.\n\nOutput Grid Size Description: The output grid size...the same\n\nOutput Transformation Description: To make the output, you have to...on the top shape, draw lines using light blue to connect the original light blue boxes to the red rectangle. Then, you will turn each original blue rectangle to yellow. On the bottom shape, you will mirror what you did on the top shape, except extend the lines all the way to the edge of the grid. You do not use any yellow on the bottom shape.",
    "6773b310.json": "Input Description: In the input, you should see...A 3 high and 3 wide square with 9 square sections, each with pink squares\n\nOutput Grid Size Description: The output grid size...Reduce the grid size so that one square is available for each group. Each 3 by 3 should need a single square.\n\nOutput Transformation Description: To make the output, you have to...For each section that hold 2 pink squares, represent that area with a blue box on the new grid. Single squares are shown as black.",
    "67a3c6ac.json": "Input Description: In the input, you should see...a wild pattern of colors\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...create a right to left mirror image.",
    "67a423a3.json": "Input Description: In the input, you should see...two different color lines that cross.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...create a yellow square around the point where the two lines meet.",
    "67e8384a.json": "Input Description: In the input, you should see...a 3x3 grid\n\nOutput Grid Size Description: The output grid size...6x6 grid\n\nOutput Transformation Description: To make the output, you have to... copy-paste the pattern in each corner. the pattern on the bottoms flips parallel to the top",
    "681b3aeb.json": "Input Description: In the input, you should see...two colored shapes against a black grid.\n\nOutput Grid Size Description: The output grid size...should be 3x3.\n\nOutput Transformation Description: To make the output, you have to...place both shapes together until they form a 3x3 square.",
    "6855a6e4.json": "Input Description: In the input, you should see...two parallel red brackets with a gray shape outside of each bracket. The gray shapes are both different in nature.\n\nOutput Grid Size Description: The output grid size...remains the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...leave the red brackets as they are. The gray shapes will move from outside the brackets to in between the brackets. Imagine pulling the gray shape by the edge closest to the bracket and placing that edge four columns over inside the brackets. Then, flip the gray object over like you would flip over a playing card. What you have may result in the two gray shapes now touching, or they may have space between them. There should be one column of black between the red bracket and its correlating gray shape.",
    "68b16354.json": "Input Description: In the input, you should see... a grid of random colored dots.\n\nOutput Grid Size Description: The output grid size... is the same as the original.\n\nOutput Transformation Description: To make the output, you have to... flip the original grid vertically.",
    "694f12f3.json": "Input Description: In the input, you should see...a 10x10 grid\n\nOutput Grid Size Description: The output grid size...should remain the same\n\nOutput Transformation Description: To make the output, you have to...fill in the shapes with red and blue. The one with the most internal blocks, should be red.",
    "6a1e5592.json": "Input Description: In the input, you should see... a red \"ground\" at the top of the grid and some gray item below.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... the item fill the ground like piece from a well-know game, and the item become dark blue.",
    "6aa20dc0.json": "Input Description: In the input, you should see...a 3x3 grid consisting of three colors (excluding the background color) and at least one other cluster of squares that have two of the colors of the 3x3 grid.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...leave the background the same color and use the 3x3 grid as a reference to fill in the third color between the other cluster to complete the pattern seen in the 3x3 grid.",
    "6b9890af.json": "Input Description: In the input, you should see...color that make grid\n\nOutput Grid Size Description: The output grid size...should be color grid size.\n\nOutput Transformation Description: To make the output, you have to...create color grid size and make the design pattern within the grid",
    "6c434453.json": "Input Description: In the input, you should see...black background with red closed and open patterns\n\nOutput Grid Size Description: The output grid size...same as the input\n\nOutput Transformation Description: To make the output, you have to...replace closed patterns with red sign with black corners",
    "6cdd2623.json": "Input Description: In the input, you should see...a grid of colored squares where four on the edge are the only four squares of a single color\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...only join the four squares on the edge to the square on the other side. The rest of the grid is black.",
    "6cf79266.json": "Input Description: In the input, you should see... a grid filled randomly with a certain color and a black background.\n\nOutput Grid Size Description: The output grid size... remains the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... FOR EACH identifiable 3x3 black grid within the random pattern, MAKE a 3x3 dark blue square if APPLICABLE and POSSIBLE",
    "6d0160f0.json": "Input Description: In the input, you should see...9 squares created by lines of grey\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...take the 3x3 area with a yellow square and move it into a 3x3 area corresponding to where the yellow square is within the 9 squares. Then make all other squares within the other 9 squares black and any grey squares within the 9 squares black. The lines of grey stay.",
    "6d0aefbc.json": "Input Description: In the input, you should see...a 3x3 grid\n\nOutput Grid Size Description: The output grid size...a 3x6 grid\n\nOutput Transformation Description: To make the output, you have to...copy the pattern and flip it to the other side",
    "6d58a25d.json": "Input Description: In the input, you should see...an large shape and cubes of a different color\n\nOutput Grid Size Description: The output grid size...stay the same\n\nOutput Transformation Description: To make the output, you have to...make vertical lines from the first empty block under the large shape to the very end only on the grid that have a colored block existing already  under the large area.  The color should be the same as the small cubes already there.",
    "6d75e8bb.json": "Input Description: In the input, you should see...a black background with a portion filled in with light blue.\n\nOutput Grid Size Description: The output grid size...the same as the input\n\nOutput Transformation Description: To make the output, you have to...make the blue are a complete rectangle, except you fill in the missing squares with red. The black background remains the same.",
    "6e02f1e3.json": "Input Description: In the input, you should see...a 3x3 grid that may have between 1 and 3 colors.\n\nOutput Grid Size Description: The output grid size...it stays the same.\n\nOutput Transformation Description: To make the output, you have to...place 3 grey boxes in various spots based on how many colors there are in the input grid. If there is one color, put 3 grey boxes on the top of the grid. If there are two colors, place a diagonal line of grey boxes form top left to bottom right. If there are 3 colors, place a diagonal line of grey boxes going from bottom left to top right.",
    "6e19193c.json": "Input Description: In the input, you should see...two L-shaped areas consisting of three cubes, all the same color.\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...fill in a diagonal line starting from the center of L-shape (except for the first cube on the inside of the L) that continues until the edge of the grid, in the same color as the input grid.",
    "6e82a1ae.json": "Input Description: In the input, you should see... the grey shapes\n\nOutput Grid Size Description: The output grid size...same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...count the 4 grid shape and color it with blue in the output and follow the same for 2 grid with green and 3 grid with red.",
    "6ecd11f4.json": "Input Description: In the input, you should see...a small multi colored grid and a larger rectangle of that is one color plus BLACK\n\nOutput Grid Size Description: The output grid size...the same as the small multi colored grid\n\nOutput Transformation Description: To make the output, you have to...replicate the smaller grid. Change the colors to black where they are black in the larger rectangle",
    "6f8cd79b.json": "Input Description: In the input, you should see... a black grid.\n\nOutput Grid Size Description: The output grid size... should be the same as the input.\n\nOutput Transformation Description: To make the output, you have to... make a blue shape around the outside of the entire grid. The center squares should be black but the blue shape should go all the way around the perimeter of the grid.",
    "6fa7a44f.json": "Input Description: In the input, you should see...a 3x3 pattern.\n\nOutput Grid Size Description: The output grid size...is 3x6 vertical grid.\n\nOutput Transformation Description: To make the output, you have to...place the input grid in the top 3x3 space and create a mirror image in the bottom 3x3 space.",
    "72322fa7.json": "Input Description: In the input, you should see...colored squares with shapes around some of them.\n\nOutput Grid Size Description: The output grid size...is the same as the original.\n\nOutput Transformation Description: To make the output, you have to...form the corresponding pattern around every like-colored square, so that every colored square of the same color has the same pattern around it.",
    "72ca375d.json": "Input Description: In the input, you should see...several figures on a big grid.\n\nOutput Grid Size Description: The output grid size...is the same size as one of the figures, zooming in\n\nOutput Transformation Description: To make the output, you have to...copy one of the figures and just that figure.",
    "73251a56.json": "Input Description: In the input, you should see...change the color\n\nOutput Grid Size Description: The output grid size...size change of grid\n\nOutput Transformation Description: To make the output, you have to...follow the instruction",
    "7447852a.json": "Input Description: In the input, you should see... a red v-pattern that create black spaces.\n\nOutput Grid Size Description: The output grid size... is the same as the input size\n\nOutput Transformation Description: To make the output, you have to... Fill the first black space from the left with yellow. Continuing right, skip two black spaces and fill the next with yellow. Keep going until you reach the edge of the grid.",
    "7468f01a.json": "Input Description: In the input, you should see...a colored object with a black background.\n\nOutput Grid Size Description: The output grid size...be the size of the colored object.\n\nOutput Transformation Description: To make the output, you have to...copy and mirror the colored object.",
    "746b3537.json": "Input Description: In the input, you should see...good sections\n\nOutput Grid Size Description: The output grid size...grid size change to correctly\n\nOutput Transformation Description: To make the output, you have to...output pattern set",
    "74dd1130.json": "Input Description: In the input, you should see...two or more color squares on a gray background.\n\nOutput Grid Size Description: The output grid size...remains the same\n\nOutput Transformation Description: To make the output, you have to...move the entire grid on the diagonal and mirror it. Imagine the top right and pull it down and to the left.",
    "75b8110e.json": "Input Description: In the input, you should see... a 8x8 grid with a black background and 4 distinct quadrants.The top left quadrant should have a yellow pattern, the top right quadrant should have a gray pattern, the bottom left should have a pink pattern, the bottom right should have a brown pattern.\n\nOutput Grid Size Description: The output grid size... becomes 4x4.\n\nOutput Transformation Description: To make the output, you have to... resize the output grid to 4x4. Copy the top-left (yellow) pattern. Then, superimpose the bottom-right (brown) pattern on top. Then, superimpose the bottom-left pattern (pink) on top. Then, superimpose the top-right (gray) pattern on top.",
    "760b3cac.json": "Input Description: In the input, you should see...two colored objects, one above the other.\n\nOutput Grid Size Description: The output grid size...is identical.\n\nOutput Transformation Description: To make the output, you have to...create a mirror image of the top shape and place it to the side of that shape.",
    "776ffc46.json": "Input Description: In the input, you should see...various shapes with some that are surrounded by a complete gray border or an incomplete gray border.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...copy all shapes over to output including the gray borders.  Change the colors of the same shapes that are in the gray border to the same color as the one in the gray border.",
    "77fdfe62.json": "Input Description: In the input, you should see...different colors on each corner\n\nOutput Grid Size Description: The output grid size...is the same size as the middle grid\n\nOutput Transformation Description: To make the output, you have to...use the 4 colors from the corner to make the middle pattern",
    "780d0b14.json": "Input Description: In the input, you should see...several different colors\n\nOutput Grid Size Description: The output grid size...that can contain one square of each color\n\nOutput Transformation Description: To make the output, you have to...put each color in one square that match their position in the big picture",
    "7837ac64.json": "Input Description: In the input, you should see...color grid which make of square box.\n\nOutput Grid Size Description: The output grid size...is 3x3\n\nOutput Transformation Description: To make the output, you have to...see four same color corners as one same color grid and color the grid with the corner color",
    "794b24be.json": "Input Description: In the input, you should see...some colored blocks on the grid.\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid.\n\nOutput Transformation Description: To make the output, you have to...change the color of the blocks and move them all to the top of the grid and start filling in the blocks from left to right keeping the same number of blocks from the original grid.",
    "7b6016b9.json": "Input Description: In the input, you should see... a colored grid all the same color with lines one block wide\n\nOutput Grid Size Description: The output grid size... the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... fill in all holes with red and fill the outside with green",
    "7b7f7511.json": "Input Description: In the input, you should see...colored squares.\n\nOutput Grid Size Description: The output grid size...will be half of the input.\n\nOutput Transformation Description: To make the output, you have to...copy one half of the input.",
    "7c008303.json": "Input Description: In the input, you should see... a 9x9 grid with a light blue cross dividing the input into 4 sections. One section will be 2x2 with many colors, call this section A. Another section will be 6x6 with only green and black, call this section B.\n\nOutput Grid Size Description: The output grid size... is 6x6.\n\nOutput Transformation Description: To make the output, you have to... resize the output grid to 6x6. Copy and paste all of section B (not including the light blue cross divider) into your output grid. Then, recolor the green part of the upper-left 3x3 of your output grid to match the color of the upper-left square of section A. Repeat this for each \"quadrant\" of your output, making the color match the color of the corresponding corner of section A.",
    "7ddcd7ec.json": "Input Description: In the input, you should see...a square with some of its corner having a single grid extending from the squares corner.\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...locate any grids that extend from the corner of the square and continue extending it diagonally all the way until it reaches the border of the grid.",
    "7df24a62.json": "Input Description: In the input, you should see...a 23x23 grid with a black background.  There will also be random yellow boxes scattered around.  Some of the yellow boxes will be surrounded with blue boxes.\n\nOutput Grid Size Description: The output grid size...23x23\n\nOutput Transformation Description: To make the output, you have to....To make the output, you have to...copy and paste the exact same grid.  Find all instances of the pattern that is surrounded in blue.  Everywhere on the grid where there is the exact yellow pattern,  surround it with blue.  So,  on all sides of the yellow boxes (in the same pattern) will be blue boxes(exactly as shown in the yellow/blue pattern)",
    "7e0986d6.json": "Input Description: In the input, you should see...large section of the same color\n\nOutput Grid Size Description: The output grid size...remain the same\n\nOutput Transformation Description: To make the output, you have to...reproduce large section on black back ground, use only the color of the large section",
    "7f4411dc.json": "Input Description: In the input, you should see...Large rectangle patterns with single squares scattered around\n\nOutput Grid Size Description: The output grid size...Keep grid size as same\n\nOutput Transformation Description: To make the output, you have to...Remove the single squares so that only the large rectangle group patterns remain",
    "7fe24cdd.json": "Input Description: In the input, you should see... a pattern on a 3x3 grid\n\nOutput Grid Size Description: The output grid size... is 6x6\n\nOutput Transformation Description: To make the output, you have to... treat the input grid as the top-left corner of the output grid. Fill in the other corners of the output, maintaining radial symmetry. So, rotate the input grid 90 degrees clockwise and put that in the top left. Continue this pattern.",
    "80af3007.json": "Input Description: In the input, you should see... a black background, within which is a 9x9 pattern composed of nine solid 3x3 gray and black squares\n\nOutput Grid Size Description: The output grid size... is the size of the 9x9 pattern.\n\nOutput Transformation Description: To make the output, you have to... reproduce the 9x9 pattern. Then, within each gray 3x3 square, reproduce the 9x9 pattern, so that each 3x3 gray square is a smaller version of the 9x9 pattern.",
    "810b9b61.json": "Input Description: In the input, you should see... some blue figures against a black background.\n\nOutput Grid Size Description: The output grid size... is identical to the input grid.\n\nOutput Transformation Description: To make the output, you have to... re-color green only the blue figures that form closed boxes.",
    "82819916.json": "Input Description: In the input, you should see... one complete line and at least one incomplete line. Each line is made of two colors.\n\nOutput Grid Size Description: The output grid size... is the same as the input.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Then, you have to complete each incomplete line. Maintain the lines color scheme while matching the pattern of the single complete line.",
    "83302e8f.json": "Input Description: In the input, you should see... an array of black squares separated by a partially broken grid of colored lines.\n\nOutput Grid Size Description: The output grid size... is identical to the input grid.\n\nOutput Transformation Description: To make the output, you have to... for every black square that has fully solid borders, recolor from black to green. For every square that has broken borders, recolor from black to yellow. Leave border lines in the original color.",
    "834ec97d.json": "Input Description: In the input, you should see...one square that's not yellow\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...move the square that's not yellow down one space. Then create a yellow line above the square to the top of the grid. Next, leave a black column on both sides of the yellow. Then, make identical yellow columns using this pattern.",
    "8403a5d5.json": "Input Description: In the input, you should see... a color grid.\n\nOutput Grid Size Description: The output grid size...same as input grid size. copy and paste the same input grid.\n\nOutput Transformation Description: To make the output, you have to... fill the grid color of input for one vertical line and leave the next vertical line black and fill the next vertical line with input color and repeat this starting the input grid color from left to right.",
    "846bdb03.json": "Input Description: In the input, you should see...a black grid with colored blocks.\n\nOutput Grid Size Description: The output grid size...should be the same size as the colored blocks with the yellow on the on the end and the black blocks between them.\n\nOutput Transformation Description: To make the output, you have to...rotate the blocks without the yellow so they fit between the blocks with the yellow on the end and the colors match up. All colors should fit within the two sets of blocks with the yellow on the end without a need to go beyond the yellow blocks.",
    "855e0971.json": "Input Description: In the input, you should see... black tiles placed in blocks of color\n\nOutput Grid Size Description: The output grid size... stays the same\n\nOutput Transformation Description: To make the output, you have to...make the black tiles into lines that end at the color blocks they are in, if the color blocks appear vertically then the black lines should be horizontally, if the color blocks appear horizontally then the black lines should be vertical",
    "85c4e7cd.json": "Input Description: In the input, you should see...a box with a different color at each layer.\n\nOutput Grid Size Description: The output grid size...is the same size.\n\nOutput Transformation Description: To make the output, you have to...reverse the order of the colors, so the color in the center of the original grid is now the color of the outermost layer. Continue this pattern.",
    "868de0fa.json": "Input Description: In the input, you should see...a black grid with five blue-border squares.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...fill the squares with an even number grid INSIDE the blue border with red, and the rest (1x1, 3x3, 5x5) squares with the color you get from red   yellow.",
    "8731374e.json": "Input Description: In the input, you should see...a single colored grid within a large grid. The single colored grid will contain a second color block or blocks.\n\nOutput Grid Size Description: The output grid size...must be the same size as the large single colored grid.\n\nOutput Transformation Description: To make the output, you have to...fill in the entire row and column with the same color of the smaller cell. For example, if you have three single colored cells, you should end up with three columns and three rows.",
    "88a10436.json": "Input Description: In the input, you should see... a multi-colored 3x3 shape and a single gray square on a black background.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to... copy the input. Then, copy the colorful shape and paste it on top of the gray square, making sure the center of the shape is directly above the square.",
    "88a62173.json": "Input Description: In the input, you should see...squares of black and another color.\n\nOutput Grid Size Description: The output grid size...will be 2x2.\n\nOutput Transformation Description: To make the output, you have to...replicate one of the patterns in one of the corners. Bottom right, bottom left, top right, or top left.",
    "890034e9.json": "Input Description: In the input, you should see...a large grid with one shape with a black center\n\nOutput Grid Size Description: The output grid size...the grid size is the same\n\nOutput Transformation Description: To make the output, you have to...count the number of black square in the center of the outlined shape. Somewhere else on the grid is a group of black square that has has the same arrangement, though there may be additional black squares as well. Replicate the original shape from the input grid using those black square as the center. There should be two identical shapes when you are done.",
    "8a004b2b.json": "Input Description: In the input, you should see...four yellow squares and boxes of color within these yellow corners as well as a shape outside the yellow corner squares\n\nOutput Grid Size Description: The output grid size...should be the yellow squares and within only\n\nOutput Transformation Description: To make the output, you have to...recreate the pattern outside the yellow corner squares within the yellow corner squares with provided starting shapes",
    "8be77c9e.json": "Input Description: In the input, you should see...a 3x3 grid with blue squares\n\nOutput Grid Size Description: The output grid size...will change to a 3x6 grid\n\nOutput Transformation Description: To make the output, you have to...copy the input grid into the top of the new output grid. Then you will turn the input grid upside down and copy it in the bottom of the output grid. This will create a mirror image (top to bottom)",
    "8d5021e8.json": "Input Description: In the input, you should see...four black boxes and two boxes of another color\n\nOutput Grid Size Description: The output grid size...is six of the input grid, two wide and three long\n\nOutput Transformation Description: To make the output, you have to...put the input grid in the center of your output grid. then create repeat the patterns but flip them.",
    "8d510a79.json": "Input Description: In the input, you should see...a square with a gray line and blue and red tiles\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...complete a line with the colors. If it's red, fill the line in until you hit the gray bar. If it's blue, fill in until you hit the bottom or top edge.",
    "8e1813be.json": "Input Description: In the input, you should see...a black background with  a colored square and different colored lines.\n\nOutput Grid Size Description: The output grid size...is the same size as the colored square.\n\nOutput Transformation Description: To make the output, you have to...repeat the color lines in the same horizontal or vertical order as they appear in the input. The lines should go all the way across the grid to form stripes that are in the same color order and orientation as the input.",
    "8e5a5113.json": "Input Description: In the input, you should see...a colored square and two black squares.\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...copy the first square exactly. Then in the next black square rotate the color pattern 90 degrees to the right. Then in the final black square rotate the  pattern another 90 degrees.",
    "8eb1be9a.json": "Input Description: In the input, you should see...a pattern in the center of a black background\n\nOutput Grid Size Description: The output grid size... is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... copy the input grid, then copy the exact same pattern to fill in the whole black background.",
    "8efcae92.json": "Input Description: In the input, you should see...2 colors on black background\n\nOutput Grid Size Description: The output grid size...choose one shape and make the grid that size\n\nOutput Transformation Description: To make the output, you have to...make the grid the same size as the shape and the two colors are just like in the shape",
    "8f2ea7aa.json": "Input Description: In the input, you should see...a pattern on a black grid\n\nOutput Grid Size Description: The output grid size...the same size as the input grid.\n\nOutput Transformation Description: To make the output, you have to...Imagine the original pattern is a 3x3 grid. What you need to do is copy the pattern in the 3x3 to the 9x9 grid. So you  have 9 3x3 grid inside of the bigger grid(Top left, top middle, top right, middle left, middle, middle right, bottom left, bottom middle, bottom right). For example if the  input pattern is a l shape you would only copy this to the top middle, middle and bottom middle grid.",
    "90c28cc7.json": "Input Description: In the input, you should see... a large rectangle made up of other, smaller rectangles.\n\nOutput Grid Size Description: The output grid size... should be significantly smaller than the input. It should be the smallest number of squares needed to replicate the layout of the input, with no black visible. It can be a square or a rectangle.\n\nOutput Transformation Description: To make the output, you have to... simplify the input pattern, making the smallest rectangle into a single square and scaling down the others accordingly, until the final result resembles a zoomed-in look-alike of the input with no visible black squares.",
    "90f3ed37.json": "Input Description: In the input, you should see... a line at the top and two  start of lines at the bottom\n\nOutput Grid Size Description: The output grid size... is the same\n\nOutput Transformation Description: To make the output, you have to... finish the line so that it is the same as the top line but finish the line in dark blue",
    "913fb3ed.json": "Input Description: In the input, you should see...single colors\n\nOutput Grid Size Description: The output grid size...same size as input\n\nOutput Transformation Description: To make the output, you have to...surround green with pink color, light blue with yellow and red with blue",
    "91413438.json": "Input Description: In the input, you should see...a pattern with a amount of space colored in (from 1 to 9.)\n\nOutput Grid Size Description: The output grid size...becomes different with the different amount of colored in space, more information in the next step.\n\nOutput Transformation Description: To make the output, you have to...you have to figure out how many colored in space you have and the grid becomes different because of that. 3 = 18x18 grid, 4 = 15x15 grid, 5 = 12x12 grid, 4 = 9x9 grid, and so on. Then you make the first image and copy it across from left to right until you have it the same number of times as colored space. So if you have 5, you would copy it 5 times.",
    "91714a58.json": "Input Description: In the input, you should see...A large grid with many colors, with a 4x3 box of one color.\n\nOutput Grid Size Description: The output grid size...The grid size stays the same.\n\nOutput Transformation Description: To make the output, you have to...Turn everything black except for the 4x3 box of one color.",
    "9172f3a0.json": "Input Description: In the input, you should see...3x3 grid\n\nOutput Grid Size Description: The output grid size...9x9 grid\n\nOutput Transformation Description: To make the output, you have to...each tile in the input grid is a 3x3 grid pattern on the output. Keep same color and pattern but increase to a 9x9 grid",
    "928ad970.json": "Input Description: In the input, you should see... 4 gray dots and a colored rectangle inside all 4 dots.\n\nOutput Grid Size Description: The output grid size... is the same as the input.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Then, make the biggest rectangle possible that is enclosed by all 4 gray dots. Make this rectangle the same color as the smaller rectangle. So, the rectangle you draw should be touching the inside of each gray dot.",
    "93b581b8.json": "Input Description: In the input, you should see... a 6x6 grid with a 2x2 colored square, where each corner of the square is a different color.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Then, you will add 4 2x2 blocks to the grid, each touching the corner of the 2x2 colored square in the input. The color of each 2x2 block should be the same color as the opposite corner of the 2x2 colored square. If the 2x2 colored square is not in the center of the input, some of the 2x2 blocks you are adding may be off the page.",
    "941d9a10.json": "Input Description: In the input, you should see... a gray grid breaking up the input into many sections.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... copy the input. Then, use blue flood fill to fill in the upper-left-most section. Then, use green and flood fill to fill in the bottom-right-most section. Then, use red and flood fill to fill in the center-most section.",
    "94f9d214.json": "Input Description: In the input, you should see... a 4x8 grid with 4x4 green pattern at the top and 4x4 blue pattern at the bottom.\n\nOutput Grid Size Description: The output grid size... 4x4 grid\n\nOutput Transformation Description: To make the output, you have to... create 4x4 grid. Then copy the blue pattern to the output grid, and then copy the green pattern on top of the blue grid. Fill in all the grids that are black with red color. Finally, change the color of the grids that are green or blue into black color.",
    "952a094c.json": "Input Description: In the input, you should see...a grid with a square in one color. There will be four small different colored squares on the inside corners of the square. The rest of the inside of the square and the rest of the grid is black.\n\nOutput Grid Size Description: The output grid size... is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...take the different colored squares from the inside corners of the square and move them to the opposite outside corner of the square. For example if there is a green square on the inside bottom left corner, move it to the outside top right corner. The rest of the squares will be black.",
    "9565186b.json": "Input Description: In the input, you should see...more than one color set\n\nOutput Grid Size Description: The output grid size...no change\n\nOutput Transformation Description: To make the output, you have to...replace minority colors with gray",
    "95990924.json": "Input Description: In the input, you should see... a series of gray squares\n\nOutput Grid Size Description: The output grid size... is the same as the input\n\nOutput Transformation Description: To make the output, you have to... surround each square with the following, connected diagonally to each of the corners: Blue on the top left, Red on the top right, Green on the bottom left, Yellow on the bottom right. The end result should almost resemble a flower, with a gray center and four colored petals.",
    "963e52fc.json": "Input Description: In the input, you should see... a black grid with a pattern of blocks going horizontally in the middle\n\nOutput Grid Size Description: The output grid size... should remain the same height but double the width.\n\nOutput Transformation Description: To make the output, you have to...continue the horizontal pattern of blocks all the way to the end.",
    "97999447.json": "Input Description: In the input, you should see... a grid with randomly placed colored tiles\n\nOutput Grid Size Description: The output grid size... remains the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... alternate to the RIGHT of the colored tile with light grey and the original color UNTIL it reaches the rightmost side of the grid, REPEAT this for each applicable colored tile.",
    "97a05b5b.json": "Input Description: In the input, you should see...a pattern with \"missing\" shapes placed around it.\n\nOutput Grid Size Description: The output grid size...is the size of the pattern with missing shapes.\n\nOutput Transformation Description: To make the output, you have to...reinsert the missing shapes, bring the surrounding color as well.",
    "98cf29f8.json": "Input Description: In the input, you should see...two colors on a black background with one vertical or horizontal single line.\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...remove the single line and move the shape that is the same color as the line square up against the other shape.",
    "995c5fa3.json": "Input Description: In the input, you should see...three 4x4 grey grids divide by black lines\n\nOutput Grid Size Description: The output grid size... 3x3 grid\n\nOutput Transformation Description: To make the output, you have to...make three rows of three different solid colors corresponding to the grey 4x4 blocks. The first 4x4 block is the color of the top row, and so on.Grey 4x4 with a 2x2 black box in the middle = light blueGrey 4x4 with no black = redGrey 4x4 with black box center bottom = yellowGrey 4x4 with two 1x2 black lines on the left and right = greenIf there are any more, they are a different color.",
    "99b1bc43.json": "Input Description: In the input, you should see...a 4x4 square of blue and black boxes on top of a yellow line. Below the yellow line is a 4x4 square of red and black boxes.\n\nOutput Grid Size Description: The output grid size...should be 4x4.\n\nOutput Transformation Description: To make the output, you have to...compare the squares in the top and bottom 4x4 square. If they match (both black or both color) make the output square black. If they do not match, make the output square green.",
    "99fa7670.json": "Input Description: In the input, you should see...single block\n\nOutput Grid Size Description: The output grid size...extend pattern\n\nOutput Transformation Description: To make the output, you have to...add blocks",
    "9aec4887.json": "Input Description: In the input, you should see...a colored object and a light blue object.\n\nOutput Grid Size Description: The output grid size... is the same as the colored object.\n\nOutput Transformation Description: To make the output, you have to...copy the colored object and copy the light blue object inside the colored object. Then change the middle light blue blocks adjacent to the colored outlines to the same color.",
    "9af7a82c.json": "Input Description: In the input, you should see...several colored shapes interconnected\n\nOutput Grid Size Description: The output grid size...(the total number of blocks comprising the largest shape) x (the total number of shapes)\n\nOutput Transformation Description: To make the output, you have to...straighten out the shapes to become lines, hanging from the top of the new grid. The shapes will be arranged by length, longest starting at the left and shortest at the right. The largest shape should start at the top left and extend all the way down to fill the grid. The next biggest shape will fill in next to it and extend down the number of blocks of the original shape. The next smallest shape will go next extend down the number of blocks of the original shape. Do this until all shapes fill the grid horizontally. The empty space extending below the straightened shapes (now lines) in the bottom-right of the grid will be black.",
    "9d9215db.json": "Input Description: In the input, you should see...colored boxes arranged in a pattern\n\nOutput Grid Size Description: The output grid size...should be the same as the input\n\nOutput Transformation Description: To make the output, you have to...take the pattern and mirror it to the four corners like a reflection instead of a copy. One color will have 2 blocks of that color. Use that color to make a square around the grid using one for the start and the other for the end. This square will skip one block and then place a block all the way around the grid. If it encounters the patterns that you placed down skip that square",
    "9dfd6313.json": "Input Description: In the input, you should see...a pattern made of several colors\n\nOutput Grid Size Description: The output grid size...is the same\n\nOutput Transformation Description: To make the output, you have to...rotate the pattern 90 degrees to the right. then flip the pattern over, so the input is the mirror image of it as the 90 degree rotate.",
    "9ecd008a.json": "Input Description: In the input, you should see... a pattern\n\nOutput Grid Size Description: The output grid size... is 3 by 3\n\nOutput Transformation Description: To make the output, you have to... finish the pattern that would be in the black square section",
    "9edfc990.json": "Input Description: In the input, you should see...a different color blocks\n\nOutput Grid Size Description: The output grid size...should be the same as given\n\nOutput Transformation Description: To make the output, you have to...fill out the blue color to the area of where the blue block exists. when there is no blue block there is no need to fill up, just leave those blocks as empty.",
    "9f236235.json": "Input Description: In the input, you should see...a single-colored grid of symmetrical lines that intersect to create segmented boxes. The boxes are filled  and create a design.\n\nOutput Grid Size Description: The output grid size...becomes smaller. Equal to the number of segmented boxes present in the input grid\n\nOutput Transformation Description: To make the output, you have to...avoid the lines that create the boxes, and instead  focus on the pattern. Copy the pattern so that it is mirrored horizontally (left to right). You should end up with only the design from the input.",
    "a1570a43.json": "Input Description: In the input, you should see...a grid with red and green squares.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...center the red squares within the boundary created from the green squares. Copy the red design exactly, but don't put any red squares in between the four green squares. There should only be black squares in between each green corner square. The design should be totally centered by the green corner square box.",
    "a2fd1cf0.json": "Input Description: In the input, you should see... a black background with a red square and a green square.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to... create a road of light blue squares between the red and green squares. The road should travel up or down from the green square and left or right from the red square until the two meet.",
    "a3325580.json": "Input Description: In the input, you should see... colored shapes against a black background\n\nOutput Grid Size Description: The output grid size... will be the size that the output lines require.\n\nOutput Transformation Description: To make the output, you have to... identify the largest shapes by number of squares. This may be one shape or more than one shape, if they have the same number of square. Then create a vertical line for each of those shapes, in the order from left to right of the shapes, each line with the same number of squares as the input shape. If only one shape is largest, there will be one output line. If two shapes are largest together, there will be two lines, and so on.",
    "a3df8b1e.json": "Input Description: In the input, you should see...a single blue point at the bottom\n\nOutput Grid Size Description: The output grid size...is the same as the old one\n\nOutput Transformation Description: To make the output, you have to...use blue dots like stairs to reach the top",
    "a416b8f3.json": "Input Description: In the input, you should see...a pattern using colored squares\n\nOutput Grid Size Description: The output grid size...is twice as wide and the same height as the original\n\nOutput Transformation Description: To make the output, you have to...copy the pattern exactly to the new empty section. There should be two of the same pattern side-by-side.",
    "a48eeaf7.json": "Input Description: In the input, you should see...a square with blocks far from it\n\nOutput Grid Size Description: The output grid size...the same\n\nOutput Transformation Description: To make the output, you have to...move the blocks until they touch the red square on the same line",
    "a5313dff.json": "Input Description: In the input, you should see...shapes with black inside and dot in center\n\nOutput Grid Size Description: The output grid size...match the output\n\nOutput Transformation Description: To make the output, you have to...color the inside blue but if the border of shape goes outside the grid leave inside black",
    "a5f85a15.json": "Input Description: In the input, you should see...diagonal lines of colored squares.\n\nOutput Grid Size Description: The output grid size...is the same as the original.\n\nOutput Transformation Description: To make the output, you have to...change every other square on each of the diagonal lines to yellow",
    "a61ba2ce.json": "Input Description: In the input, you should see...see 4 set of 3 blocks in 4 different colors.\n\nOutput Grid Size Description: The output grid size...should be 4x4.\n\nOutput Transformation Description: To make the output, you have to...make a square with the each set of blocks. There should be a smaller black square in the center.",
    "a61f2674.json": "Input Description: In the input, you should see... grey vertical lines.\n\nOutput Grid Size Description: The output grid size... is the same as the input\n\nOutput Transformation Description: To make the output, you have to... change the shortest grey line to red and the tallest line to blue. The remaining lines turn black.",
    "a64e4611.json": "Input Description: In the input, you should see... area that appear not fill.\n\nOutput Grid Size Description: The output grid size...stay the same.\n\nOutput Transformation Description: To make the output, you have to... fill not fill area with green, leaving black border.",
    "a65b410d.json": "Input Description: In the input, you should see...a pattern of green, red and blue squares\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...go up from the red add one more green square as you go up.  If you start with 2 red squares the next would be 3 green.  Then go down from the red and use blue square.  The number should be one less than the red to start",
    "a68b268e.json": "Input Description: In the input, you should see...4x4 with all shapes\n\nOutput Grid Size Description: The output grid size...4x4 size grid\n\nOutput Transformation Description: To make the output, you have to...take the top left 4x4 on output. add top right 4x4 pattern. do not cover the first color. do the same for each section.",
    "a699fb00.json": "Input Description: In the input, you should see....a pattern of blue sections with black space between them.\n\nOutput Grid Size Description: The output grid size...stay the same\n\nOutput Transformation Description: To make the output, you have to...fill the black sections between two blue sections with red",
    "a740d043.json": "Input Description: In the input, you should see...a blue grid with a pattern some place\n\nOutput Grid Size Description: The output grid size...is the size of the pattern in the blue grid\n\nOutput Transformation Description: To make the output, you have to...make the pattern and if there is any more on the sides or any blue, fill in with black",
    "a78176bb.json": "Input Description: In the input, you should see... a diagonal line of a single color, with gray squares extending out from one or both sides of it.\n\nOutput Grid Size Description: The output grid size... is identical to the input grid.\n\nOutput Transformation Description: To make the output, you have to... keep the original colored line. Place a square of that same color on the black square that at the point of the gray extension.  Now extend another diagonal line out from that colored square, mimicking the original line. Do this on both sides if there are two gray extensions. You should now have two or three lines, including the original. Now recolor the gray squares black, and you're done!",
    "a79310a0.json": "Input Description: In the input, you should see...black background with colored squares\n\nOutput Grid Size Description: The output grid size... Same as input\n\nOutput Transformation Description: To make the output, you have to... Move colored square one line down and change to red",
    "a85d4709.json": "Input Description: In the input, you should see...two black blocks on each row from top to bottom\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to...make the row green if two blocks appear together on the left, yellow if two blocks are separated by a gray block in the middle, and red if two blocks appear together on the right on each row",
    "a87f7484.json": "Input Description: In the input, you should see...different patterns of different colors\n\nOutput Grid Size Description: The output grid size...will be 3x3\n\nOutput Transformation Description: To make the output, you have to...find the color with the most spaces colored and put that pattern into the 3x3",
    "a8c38be5.json": "Input Description: In the input, you should see... multiple 3x3 squares with gray and colored shapes within them\n\nOutput Grid Size Description: The output grid size... changes to a 9x9 grid\n\nOutput Transformation Description: To make the output, you have to... rearrange each of those squares fully that colors line up along the edge. Start with the fully gray 3x3 in the middle. Then corners should line up in the corners that the color touches the edge.Rearrange the rest of the 3x3 grids that the color remains on the edge.",
    "a8d7556c.json": "Input Description: In the input, you should see...a pattern of black and grey colored boxes\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...Make the boxes that have the same color of black shapes that are bigger than 1x1 red",
    "a9f96cdd.json": "Input Description: In the input, you should see...a red square on a black background\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to...on the grid where the red square is, place a green square to the top left of it, a pink square to the top right of it, a light blue square to the bottom left of it, an orange square to the bottom right of it, and leave out the red square",
    "aabf363d.json": "Input Description: In the input, you should see...a pattern and one colored square at the bottom\n\nOutput Grid Size Description: The output grid size...should be the same as the input\n\nOutput Transformation Description: To make the output, you have to...change the pattern to match the one colored square at the bottom and fill in the one square at the bottom to black",
    "aba27056.json": "Input Description: In the input, you should see...a 7x7black grid with a single color pattern.\n\nOutput Grid Size Description: The output grid size...does not change.\n\nOutput Transformation Description: To make the output, you have to...fill in the pattern with yellow,  color the black squares that make a straight line to the edge of the grid yellow, and create one yellow diagonal line from the line to the edge.",
    "ac0a08a4.json": "Input Description: In the input, you should see... single small fill.\n\nOutput Grid Size Description: The output grid size... increase  by number of fill.\n\nOutput Transformation Description: To make the output, you have to... make new fill square big by the number of original fill.",
    "ae3edfdc.json": "Input Description: In the input, you should see...one red box and one blue box. There will also be multiple green and orange boxes.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to...keep the blue and red boxes in the same place. Then move the orange and green boxes toward the blue and red ones. Orange boxes move directly toward blue while green boxes move directly toward red.",
    "ae4f1146.json": "Input Description: In the input, you should see...four 3x3 squares with blue and light blue pixels\n\nOutput Grid Size Description: The output grid size...is 3x3\n\nOutput Transformation Description: To make the output, you have to....copy the 3x3 square from the input grid that has the most blue pixels.",
    "aedd82e4.json": "Input Description: In the input, you should see... a number of different size shapes.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to... copy the input grid. Any shapes which only contain one single square should be colored blue.",
    "af902bf9.json": "Input Description: In the input, you should see....4 yellow in a square form\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to...put red in the middle of the yellow square structure, but not actually next to any of the yellow squares",
    "b0c4d837.json": "Input Description: In the input, you should see...a bucket holding some level of water\n\nOutput Grid Size Description: The output grid size...is a 3x3 grid\n\nOutput Transformation Description: To make the output, you have to...Start at the upper left and add a light blue pixel for every empty row of the bucket. Fill in the top row first and then begin the second row beginning at the right.",
    "b190f7f5.json": "Input Description: In the input, you should see...some squares of various colors on one half of the grid and some blue square that make a pattern on the opposite side of the grid.\n\nOutput Grid Size Description: The output grid size...will be the size of grid with the light blue squares multiplied by the length of the grid with the light blue squares. So, for example, if the light blue squares are in a 4x4 grid, the output grid will be 16x16.\n\nOutput Transformation Description: To make the output, you have to...replace each of the colored squares on the input grid with the light blue pattern but in the color of the square, then orient the pattern to correspond with the colored squares in the new grid.",
    "b1948b0a.json": "Input Description: In the input, you should see...two colors, one of which is orange.\n\nOutput Grid Size Description: The output grid size... is the same as the input size\n\nOutput Transformation Description: To make the output, you have to... turn the not-orange color into light red.",
    "b230c067.json": "Input Description: In the input, you should see...all patterns that have the same light blue color.\n\nOutput Grid Size Description: The output grid size...should be the same with the same shapes.\n\nOutput Transformation Description: To make the output, you have to...color the two similar shapes the same dark blue color and then change the third shape to the red color.",
    "b27ca6d3.json": "Input Description: In the input, you should see... some single and paired red boxes on a black field\n\nOutput Grid Size Description: The output grid size...be the same as the input\n\nOutput Transformation Description: To make the output, you have to...surround the paired red boxes with green boxes",
    "b2862040.json": "Input Description: In the input, you should see...a dark red background with light blue closed pattern in light blue and line-only pattern in dark blue.\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...make all the closed dark blue patterns light blue.",
    "b527c5c6.json": "Input Description: In the input, you should see... green shapes on a black background. On the edge of each shape is a red dot.\n\nOutput Grid Size Description: The output grid size... stays the same.\n\nOutput Transformation Description: To make the output, you have to... look at the dot on the edge of each shape. Counting away from the edge, how many green dots follow the red dot, before you reach the opposite edge? From the red dot, draw a line to the edge of the picture. Then on each side of the red line, draw a green border of the same thickness as the number of green dots you counted before.",
    "b548a754.json": "Input Description: In the input, you should see...a blue dot with a square or rectangle that have two colors one for the outside and one for the inside of the shape.\n\nOutput Grid Size Description: The output grid size...same grid as input\n\nOutput Transformation Description: To make the output, you have to...from where the outer square or rectangle is.Stretch it until the outer color covers the dot and then fill in the shape with the inner color.This should stretch the shape in general towards the dot itself.",
    "b60334d2.json": "Input Description: In the input, you should see...different gray squares in the middle\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...place blue to the top, bottom, left, and right of each gray square, change the gray square to black so that it looks like a blue plus sign with a black center, and finally add gray squares on each corner of the plus sign to end up with gray, blue and black squares that are 3x3",
    "b6afb2da.json": "Input Description: In the input, you should see... two gray squares.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to... the squares stay in the same place but change color. The corner become dark blue. The middle become red. The edge between the corner become yellow.",
    "b7249182.json": "Input Description: In the input, you should see... two different colored cubes at opposite ends of the grid.\n\nOutput Grid Size Description: The output grid size... remains the same.\n\nOutput Transformation Description: To make the output, you have to... turn each colored square into a row of five extending from the original square across the grid to the other colored row. From the last square in the row, make a perpendicular column 5 squares tall. Add one more to the first and last of this column to connect the two figures",
    "b775ac94.json": "Input Description: In the input, you should see...small clusters of different colored squares and a design nearby that uses only one of those colors.\n\nOutput Grid Size Description: The output grid size...is the same as the original.\n\nOutput Transformation Description: To make the output, you have to...form the same pattern off of the other colored squares, positioned like a mirror image of the original.",
    "b782dc8a.json": "Input Description: In the input, you should see...a pattern that needs to be completed\n\nOutput Grid Size Description: The output grid size...the same\n\nOutput Transformation Description: To make the output, you have to...finish the pattern only on that area",
    "b8825c91.json": "Input Description: In the input, you should see... a complex pattern of colors with some distinct yellow rectangles\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...remove the yellow rectangles and replace the color to match the existing pattern",
    "b8cdaf2b.json": "Input Description: In the input, you should see... a structure of different colors along the bottom of the grid.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to... create a diagonal line from the top of the structure to the edge of the grid in the same color as the interior color of the original structure.",
    "b91ae062.json": "Input Description: In the input, you should see...various colored squares and the rest will be black in a 3x3 grid.\n\nOutput Grid Size Description: The output grid size... will zoom out to either 6x6, 9x9, or 12x12, depending how many colors are used (2 colors would make the output 6x6, 3 colors would be 9x9, etc).\n\nOutput Transformation Description: To make the output, you have to... just multiply the size of the output grid as stated in the last sentence, but make sure the colors take up as much space as before (if it's a 9x9 grid, each color square will be 3x3, for instance).",
    "b94a9452.json": "Input Description: In the input, you should see...a square shape with a smaller square centered inside of the larger square on a black background. The two squares are different colors.\n\nOutput Grid Size Description: The output grid size...is the same size as the larger square.\n\nOutput Transformation Description: To make the output, you have to...make an output grid that is the same size as the larger square. The size and placement of the smaller inner square should be the same relative to the input grid. The colors of the two squares should be swapped.",
    "b9b7f026.json": "Input Description: In the input, you should see...several square and rectangle objects.\n\nOutput Grid Size Description: The output grid size...will be 1x1\n\nOutput Transformation Description: To make the output, you have to...copy the color of the square or rectangle that is not solid.",
    "ba26e723.json": "Input Description: In the input, you should see...alternating pairs of yellow blocks going up and down.\n\nOutput Grid Size Description: The output grid size...is the same size.\n\nOutput Transformation Description: To make the output, you have to...start by changing the first set of two blocks to pink. Then skip two pairs and change the next two pink. Complete this pattern to the end of the grid.",
    "ba97ae07.json": "Input Description: In the input, you should see... two colored line touching\n\nOutput Grid Size Description: The output grid size... is the same\n\nOutput Transformation Description: To make the output, you have to... make the other color line on top",
    "bb43febb.json": "Input Description: In the input, you should see... two gray rectangles.\n\nOutput Grid Size Description: The output grid size... will be the same size as the input grid (10x10).\n\nOutput Transformation Description: To make the output, you have to... color in the center of each gray square red, but make sure you leave a 1 square gray border around it (so if it's a 5x5 gray square, you would color a red 3x3 square inside it, leaving a gray border around the red square).",
    "bbc9ae5d.json": "Input Description: In the input, you should see...a single row that has a certain number of colored boxes with black box(es) at the end.\n\nOutput Grid Size Description: The output grid size...the same width as the input grid and the height is exactly 1/2 of the width of the input grid. For example, if the original grid is 8 boxes wide the new grid will be 8x4 (8 wide and 4 tall).\n\nOutput Transformation Description: To make the output, you have to...make the top row the same as the row shown in the input grid. Every row that goes down adds one more colored box. So, if the top row has 4 colored boxes, the next row down has 5 and then the next row has 6...etc. This will look like a staircase when you are done. Keep going until the grid is finished.",
    "bc1d5164.json": "Input Description: In the input, you should see... a black background with a foreground color.\n\nOutput Grid Size Description: The output grid size... shrinks to a 3x3 grid.\n\nOutput Transformation Description: To make the output, you have to... imagine you are squishing the original grid horizontally and vertically. The colored dots move and overlap on top of the background.",
    "bd4472b8.json": "Input Description: In the input, you should see...grids in the first row with different filled colors\n\nOutput Grid Size Description: The output grid size...should be the same\n\nOutput Transformation Description: To make the output, you have to...filled the black grid from the third row with the colors specified in the first row. For example, fill the third row with the color in the first row and first column, and repeat.",
    "bda2d7a6.json": "Input Description: In the input, you should see... a series of squares inside of squares\n\nOutput Grid Size Description: The output grid size... is the same as the input\n\nOutput Transformation Description: To make the output, you have to... change the color of the center square to the color of the second square, then change the second square to the color of the third square, and continue until you get to the largest square which should take on the color of the input center square",
    "bdad9b1f.json": "Input Description: In the input, you should see...start of two lines\n\nOutput Grid Size Description: The output grid size...no change\n\nOutput Transformation Description: To make the output, you have to...continue lines and where crosses color light",
    "be94b721.json": "Input Description: In the input, you should see...colored boxes on a black background\n\nOutput Grid Size Description: The output grid size...is zoomed on the largest colored pattern.\n\nOutput Transformation Description: To make the output, you have to...copy the pattern as a full square or rectangle including black boxes.",
    "beb8660c.json": "Input Description: In the input, you should see...different color in a line on a grid\n\nOutput Grid Size Description: The output grid size...it is the same grid.\n\nOutput Transformation Description: To make the output, you have to...you take each color and form a step with them with the single top step on the right side and the bottom all the way across.",
    "c0f76784.json": "Input Description: In the input, you should see...grey squares.\n\nOutput Grid Size Description: The output grid size...the same as the input.\n\nOutput Transformation Description: To make the output, you have to...fill the center of the smallest square with pink, the middle square with dark yellow and the biggest square with light blue.",
    "c1d99e64.json": "Input Description: In the input, you should see...herself\n\nOutput Grid Size Description: The output grid size...included\n\nOutput Transformation Description: To make the output, you have to...corresponding",
    "c3e719e8.json": "Input Description: In the input, you should see...a 3x3 grid with all colored boxes.\n\nOutput Grid Size Description: The output grid size...needs to be 9x9.\n\nOutput Transformation Description: To make the output, you have to...Notice that you can copy the original 3x3 grid 9 times into the new grid (nine 3x3 patterns) and fill out the new grid in this pattern. Now look at which color is the most common in the input grid and keep that in mind. For example, if blue is the most common color in the input box and the top, left box is blue then copy the entire 3x3 box into the top, left 3x3 area in the new grid. If the bottom, middle box is blue then copy the entire 3x3 grid into the middle top of the new grid. Alternatively, suppose the top right box is red (or any other color that is not the most common) in the input grid...then that top right 3x3 area should be black in the new grid. Keep following that pattern until you're done. The black holes should now correlate to the locations of the colors of the boxes (in the input grid) that were not the most common.",
    "c3f564a4.json": "Input Description: In the input, you should see...diagonal colored lines with black sections in them.\n\nOutput Grid Size Description: The output grid size...is the same as the original.\n\nOutput Transformation Description: To make the output, you have to...fill in the black squares according to the pattern of diagonal colored squares.",
    "c444b776.json": "Input Description: In the input, you should see...a black grid with four sections\n\nOutput Grid Size Description: The output grid size...will be the same size as input\n\nOutput Transformation Description: To make the output, you have to...copy the color in one section to other three sections.",
    "c59eb873.json": "Input Description: In the input, you should see...blocks of various colors\n\nOutput Grid Size Description: The output grid size...will be double the input size, so if, for example, the input is 4x4 the output will be 8x8.\n\nOutput Transformation Description: To make the output, you have to...divide each block  into a 2x2 square in the same color as the original block. So, each block from the original input grid will become a 2x2 block of 4 squares of the same color as the original block.",
    "c8cbb738.json": "Input Description: In the input, you should see...a solid color background with (4) colored squares placed to make general shapes throughout the grid. Each different shape is represented by colored blocks and background blocks. The colored blocks are an outline to the shape, but not fully filled in.\n\nOutput Grid Size Description: The output grid size...changes to match the amount of squares used to make up the largest shape within the input grid. So, if there are three different shapes outlined and the largest is a 4x4 square, then the output grid would be 4x4 in size.\n\nOutput Transformation Description: To make the output, you have to...reduce the grid to match the size of the largest outline shape. Then overlay the different colored squares on top of the colored background. So if there is a dark blue background and you see an outline of (4) orange squares that make a square outline and four red squares that make a red cross, then you would put the orange squares at the corners of the output grid, and place the red cross in that shape between the orange, and the center square would be a dark blue square.",
    "c8f0f002.json": "Input Description: In the input, you should see...blue and yellow colors\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...change the yellow grids into grey one",
    "c909285e.json": "Input Description: In the input, you should see...a a small square inside the input grid with border.\n\nOutput Grid Size Description: The output grid size...is the same as the small square inside the input grid.\n\nOutput Transformation Description: To make the output, you have to...copy the entire small square grid without change in  the pattern or the colors along with the border.",
    "c9e6f938.json": "Input Description: In the input, you should see... a simple 3x3 pattern of orange and black dots.\n\nOutput Grid Size Description: The output grid size... doubles horizontally, so instead of 3x6 it's now 6x3.\n\nOutput Transformation Description: To make the output, you have to... copy the original pattern to the left half of the grid, then mirror it on the right, like an inkblot.",
    "c9f8e694.json": "Input Description: In the input, you should see...a pattern of colored squares and some gray blocks\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size\n\nOutput Transformation Description: To make the output, you have to...fill each gray block with the color from the colored blocks that is on the same horizontal row",
    "caa06a1f.json": "Input Description: In the input, you should see... a pattern in the top left corner and a border of a different color\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...remove the solid color border and repeat the corner pattern",
    "cbded52d.json": "Input Description: In the input, you should see...nine blocks in rows of three, up and down, with colored patterns.\n\nOutput Grid Size Description: The output grid size...is identical.\n\nOutput Transformation Description: To make the output, you have to...make each across and down row identical, matching the middle block in each row to the end blocks.",
    "cce03e0d.json": "Input Description: In the input, you should see...a 3x3 grid of colored squares with\n\nOutput Grid Size Description: The output grid size...is 9x9\n\nOutput Transformation Description: To make the output, you have to...Visualize the output grid as nine 3x3 blocks. The red squares on your input indicate which 'blocks' in your 9x9 grid you should work in. Copy the 3x3 input pattern to the 'blocks' indicated by the location of the red squares.",
    "cdecee7f.json": "Input Description: In the input, you should see...common pattern\n\nOutput Grid Size Description: The output grid size...picture\n\nOutput Transformation Description: To make the output, you have to...mention",
    "ce22a75a.json": "Input Description: In the input, you should see...a black background with gray squares\n\nOutput Grid Size Description: The output grid size...the same as input grid\n\nOutput Transformation Description: To make the output, you have to...change every gray square and the 9 squares around it into blue.",
    "ce4f8723.json": "Input Description: In the input, you should see...a long grid with several colors\n\nOutput Grid Size Description: The output grid size...4 by 4\n\nOutput Transformation Description: To make the output, you have to...join the upper and lower into one design, leaving the black spaces black and the other colors now green",
    "ce602527.json": "Input Description: In the input, you should see....three shapes\n\nOutput Grid Size Description: The output grid size...one is present\n\nOutput Transformation Description: To make the output, you have to...pick one set",
    "ce9e57f2.json": "Input Description: In the input, you should see...4 red bars that rise upward from the bottom of the grid in different heights.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...change the lower half of the red bars to light blue and the upper half remain red. If there are an even number of squares in the bar, the red squares and light blue squares should be even. If there are an odd number of squares in a bar, there should be one more upper red squares than there are lower blue squares.",
    "cf98881b.json": "Input Description: In the input, you should see...a left section with yellow squares.\n\nOutput Grid Size Description: The output grid size...is like the left section with the yellow squares.\n\nOutput Transformation Description: To make the output, you have to...over lay the dark red and blue areas and fill in the black squares where possible.",
    "d037b0a7.json": "Input Description: In the input, you should see...a 3x3 grid\n\nOutput Grid Size Description: The output grid size...the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...fill in the black under any color with the same color",
    "d06dbe63.json": "Input Description: In the input, you should see...a blue square.\n\nOutput Grid Size Description: The output grid size...is the same size.\n\nOutput Transformation Description: To make the output, you have to...use just grey blocks add blocks to the top of the blue box, add two up, and then two to the right. Below the blue box add grey blocks, two down and then two to the left. Repeat this pattern to the edge of the grid.",
    "d07ae81c.json": "Input Description: In the input, you should see...color pattern with single squares\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...draw from single square to diagonal out. For the new lines, make sure to keep the same color on background that is there before.",
    "d0f5fe59.json": "Input Description: In the input, you should see... blue shapes on a black background\n\nOutput Grid Size Description: The output grid size...is the same number of shapes the input grid has so if the input grid has 3 shapes, the grid size is 3x3\n\nOutput Transformation Description: To make the output, you have to...take the blue color and make a diagonal pattern starting from the up left corner and down to the bottom right corner",
    "d10ecb37.json": "Input Description: In the input, you should see...patterns in a large area\n\nOutput Grid Size Description: The output grid size...will be 2x2\n\nOutput Transformation Description: To make the output, you have to...take the pattern on the top left and put it in the 2x2 grid",
    "d13f3404.json": "Input Description: In the input, you should see...3 squares colored in random places, different color for each. all others are black\n\nOutput Grid Size Description: The output grid size...is four times the size\n\nOutput Transformation Description: To make the output, you have to...need to draw a line down and to the right from each beginning square all the way to the end of the grid",
    "d22278a0.json": "Input Description: In the input, you should see...at least two corner squares with color\n\nOutput Grid Size Description: The output grid size...is not changed\n\nOutput Transformation Description: To make the output, you have to...draw alternating squares from the corner without crossing the middle horizontal or vertical to another color",
    "d23f8c26.json": "Input Description: In the input, you should see... a random collection of colored squares.\n\nOutput Grid Size Description: The output grid size... is the same as the input.\n\nOutput Transformation Description: To make the output, you have to... turn everything black, but keep the middle vertical line of colored squares.",
    "d2abd087.json": "Input Description: In the input, you should see...a black grid with gray shapes that are varied in their size and form.\n\nOutput Grid Size Description: The output grid size...remains the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...copy the input grid. Then count how many gray squares make up each of the individual shapes. If the shape uses (6) gray squares, change those gray squares to red. If the shape has any other number of gray squares, change the gray squares to blue.",
    "d364b489.json": "Input Description: In the input, you should see...several blue squares placed at different parts\n\nOutput Grid Size Description: The output grid size...should be the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...place a orange square to the space left of any blue square, a red square in the space above any blue square, a purple square to the space on the right of any blue square and a light blue square to the space below any blue square.",
    "d406998b.json": "Input Description: In the input, you should see... Black background with gray squares\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to... Starting with second vertical, change gray to green every other vertical.",
    "d43fd935.json": "Input Description: In the input, you should see...is a large grid with multiple colored squares\n\nOutput Grid Size Description: The output grid size...stays the same\n\nOutput Transformation Description: To make the output, you have to...copy the input to the output. Look at each corner of the green box. Is there a colored square above or beside that corner? Then draw a line the same color as that square to connect it.",
    "d4469b4b.json": "Input Description: In the input, you should see...a grid with blue, green, or red squares\n\nOutput Grid Size Description: The output grid size...is 3x3.\n\nOutput Transformation Description: To make the output, you have to...make a gray grid with four black corner squares if the input is blue squares. If the input is red squares, make a make a gray grid with the bottom right and bottom left black and the middle left and middle right black. If the input is green squares, make a gray grid with a 2x2 black square in the top left.",
    "d4a91cb9.json": "Input Description: In the input, you should see... the blue grid only.\n\nOutput Grid Size Description: The output grid size...same as the input grid. copy the input grid.\n\nOutput Transformation Description: To make the output, you have to...draw a down line with yellow to which the red grid's row meet. and continue the yellow grid to the side of the red grid",
    "d4f3cd78.json": "Input Description: In the input, you should see...a gray grid with one spot open in it\n\nOutput Grid Size Description: The output grid size...the same size\n\nOutput Transformation Description: To make the output, you have to...fill the gray with light blue then extend a line out the empty spot to the the end of the grid",
    "d511f180.json": "Input Description: In the input, you should see...any and all colors\n\nOutput Grid Size Description: The output grid size...same as input grid\n\nOutput Transformation Description: To make the output, you have to...change all the gray squares to light blue and all the light blue squares to gray. Everything else keep same as input.",
    "d5d6de2d.json": "Input Description: In the input, you should see...a number of boxes with holes in them\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...fill in the holes of the boxes with green, then black out the outlines of the boxes",
    "d631b094.json": "Input Description: In the input, you should see...a grid with one color squares and black squares\n\nOutput Grid Size Description: The output grid size...be a horizontal line with the number of colored squares.\n\nOutput Transformation Description: To make the output, you have to...make the squares the same color as the colored squares.",
    "d687bc17.json": "Input Description: In the input, you should see...a grid with different colors on the border of it in and then multicolored boxes within\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...copy grid. If any of the boxes on the inside match any of the outline colors move them so they are adjoined to it, without changing the row/column it's in. Do this with every color. If a box on the inside doesn't match with an outside color then just remove it. At the end the middle area should be black and the blocks are adjoined to their respective colors.",
    "d6ad076f.json": "Input Description: In the input, you should see... two rectangles that are different colors. One should be smaller than the other.\n\nOutput Grid Size Description: The output grid size...stays the same.\n\nOutput Transformation Description: To make the output, you have to... Copy the grid. You need to connect each rectangle with a light blue straight line. The thickness of the line depends on the smaller rectangle. the light blue line should be 1 row/column less on each side than the smaller rectangle. you  are done.",
    "d89b689b.json": "Input Description: In the input, you should see...replace order\n\nOutput Grid Size Description: The output grid size...change grid size\n\nOutput Transformation Description: To make the output, you have to...follow the insturcion",
    "d8c310e9.json": "Input Description: In the input, you should see... like\n\nOutput Grid Size Description: The output grid size... good\n\nOutput Transformation Description: To make the output, you have to... nice",
    "d90796e8.json": "Input Description: In the input, you should see...a grid with gray, light blue, green and red pixels\n\nOutput Grid Size Description: The output grid size...same size as input\n\nOutput Transformation Description: To make the output, you have to...copy the exact entire image.  Where ever a green and red pixel touch on their sides (not diagonal/corners), replace the green pixel with light blue, and replace the red pixel with black (remove it)",
    "d9f24cd1.json": "Input Description: In the input, you should see...several red dots and several gray dots\n\nOutput Grid Size Description: The output grid size...is the same as the original\n\nOutput Transformation Description: To make the output, you have to...extend each red dot straight up so it forms a line to the top of the grid. If the red line would go through a gray square, the line must go to the right of it and then continue going straight up, making it a bent line.",
    "d9fac9be.json": "Input Description: In the input, you should see...various colored structures scattered around the grid with one structure a square with a different colored center block.\n\nOutput Grid Size Description: The output grid size...is the size of one block from the input grid.\n\nOutput Transformation Description: To make the output, you have to...zoom into the different colored center block from the input grid and make it the only colored block.",
    "dae9d2b5.json": "Input Description: In the input, you should see... a 6x3 grid with a yellow pattern on the left and a green pattern on the right.\n\nOutput Grid Size Description: The output grid size... is 3x3.\n\nOutput Transformation Description: To make the output, you have to... copy and paste the left-side of the input (the yellow side) onto the output grid. Then, draw the green pattern on the output grid on top of the yellow (do not copy and paste because the black will overwrite the yellow). Your output grid should now have green and yellow on a black background. Then, recolor each green and yellow square pink, so your output is only pink and black.",
    "db3e9e38.json": "Input Description: In the input, you should see...a line of five colors squares\n\nOutput Grid Size Description: The output grid size...does not change\n\nOutput Transformation Description: To make the output, you have to...copy the line then alternate light blue with the original color decreasing the line by one each time",
    "db93a21d.json": "Input Description: In the input, you should see...Red squares on a black grid.\n\nOutput Grid Size Description: The output grid size...same size as original\n\nOutput Transformation Description: To make the output, you have to...Put a green border around each red square. The thickness of the green border should equal one half of the thickness of the red square (if the square is 6 squares across then the green border should be three squares deep around it). Fill the black squares below the red and green squares with a vertical line of blue squares. The blue squares should be in the same vertical row as the red square and should be the same width as the red square. If the blue line should intersect with a green box, then the green box should stay. Don't color over any green.",
    "dbc1a6ce.json": "Input Description: In the input, you should see...a black grid with blue squares.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...draw a light blue line to connect any dark blue squares that are on the same line or row.",
    "dc0a314f.json": "Input Description: In the input, you should see...a green square against the backdrop of a patterned mosaic.\n\nOutput Grid Size Description: The output grid size...is the same size as the green square.\n\nOutput Transformation Description: To make the output, you have to...paint the green square to match the patten of the mosaic, like the missing puzzle piece.",
    "dc1df850.json": "Input Description: In the input, you should see...a series of colored boxes on a black background.\n\nOutput Grid Size Description: The output grid size...remains the same.\n\nOutput Transformation Description: To make the output, you have to...surround only the red squares with a blue border that is one square wide.",
    "dc433765.json": "Input Description: In the input, you should see...a black background with one yellow and one green square.\n\nOutput Grid Size Description: The output grid size.... remains the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...move the green square one block closer to the yellow square, no matter if it is horizontal, diagonal, or vertical.",
    "ddf7fa4f.json": "Input Description: In the input, you should see...three gray square box and three colored squares\n\nOutput Grid Size Description: The output grid size...is the same\n\nOutput Transformation Description: To make the output, you have to...color the gray box the color of the square above it",
    "de1cd16c.json": "Input Description: In the input, you should see...pink squares with different colored squares around them\n\nOutput Grid Size Description: The output grid size...is 1x1\n\nOutput Transformation Description: To make the output, you have to...look for the colored area with the largest number of pink squares and use that color",
    "ded97339.json": "Input Description: In the input, you should see...magenta boxes on a black background\n\nOutput Grid Size Description: The output grid size...is the same size as the input grid\n\nOutput Transformation Description: To make the output, you have to...connect the magenta boxes that are directly vertical and horizontal to each other.",
    "e179c5f4.json": "Input Description: In the input, you should see...one blue pixel in the bottom left corner of the grid.\n\nOutput Grid Size Description: The output grid size...stays the same. You should copy and paste the input grid.\n\nOutput Transformation Description: To make the output, you have to...add the same color dark blue pixel in a zig-zag pattern moving up the grid. Each pixel should be filled in on a diagonal going up and to the right until you read the edge of the grid. Then you should keep moving on the diagonal up and to the left until you reach the left side of the grid. Keep repeating until you reach the top  of the grid. Then fill in the rest of the spaces with the light blue color.",
    "e21d9049.json": "Input Description: In the input, you should see...a shape that has a horizontal line and a vertical line, almost like a cross or an 'L' shape. The background is black.\n\nOutput Grid Size Description: The output grid size...is the same as the input size.\n\nOutput Transformation Description: To make the output, you have to...copy the entire input into the output grid.You will need to extend each area of the shape - the horizontal line should extend and touch both the left and right edges of the grid. The vertical line should touch both the top and bottom of the grid. It should be a cross shape or similar to a cross shape.Copy only the horizontal colored squares. Paste them to the right and left of the horizontal colored squares, but take care to never effect or impact the original colored squares in any way.If the horizontal line is 3 squares, you will move three squares to the left of the left-most colored square, paste, and repeat. If you can't go 3 squares without touching the edge, then color in the pattern on your own. It should be a repeat pattern.Do the same thing with the vertical line, only do it in a vertical way instead of horizontal.",
    "e26a3af2.json": "Input Description: In the input, you should see...several bars of solid colors with random color squares in them.\n\nOutput Grid Size Description: The output grid size...is the same as the original.\n\nOutput Transformation Description: To make the output, you have to...eliminate all the random color squares and replace them with the color of the bar they are in.",
    "e3497940.json": "Input Description: In the input, you should see...a large grid separated into two black section with a set of grey blocks in the middle.\n\nOutput Grid Size Description: The output grid size...is equal to the size of one of the original black section.\n\nOutput Transformation Description: To make the output, you have to...take the right side section and turn it to the left rotating two times until all colored boxes start on the right.  The image will be the overlap of the two sides.",
    "e40b9e2f.json": "Input Description: In the input, you should see...an arrangement of colored squares in a pattern\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...Without removing anything, rotate the image clockwise 90 using the middle-most point (either grid line or square) as the axis. Fill in the squares to correspond to the new location of the pattern. Repeat until you have completed an entire rotation.",
    "e48d4e1a.json": "Input Description: In the input, you should see...the number of grey grid and the meeting point of the colored grid.\n\nOutput Grid Size Description: The output grid size...same as the input grid. copy the input grid without the grey grid.\n\nOutput Transformation Description: To make the output, you have to...count the grey grid and place the meeting point of the colored grid-down through with the same count.",
    "e5062a87.json": "Input Description: In the input, you should see...several random black squares on a grid and one distinct pattern of red squares.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...find any black squares that are in the same pattern as the red squares, then change the black squares in each pattern to red.",
    "e509e548.json": "Input Description: In the input, you should see... several green designs\n\nOutput Grid Size Description: The output grid size... stays the same as the input\n\nOutput Transformation Description: To make the output, you have to... change design color to blue if the design only has one 90 degree edge , pink if it has two, and red if it has three",
    "e50d258f.json": "Input Description: In the input, you should see...several rectangular shapes with dark blue, light blue, and red\n\nOutput Grid Size Description: The output grid size...is the size of the rectangular shape with the most red squares\n\nOutput Transformation Description: To make the output, you have to...copy the rectangular shape with the most red squares exactly",
    "e6721834.json": "Input Description: In the input, you should see....a large grid with two different colors.\n\nOutput Grid Size Description: The output grid size...is one half the size of the original grid with the same orientation\n\nOutput Transformation Description: To make the output, you have to...change the output grid to the background color that does not include the two boxes.  Next place the colored boxes on the grid where the interior colored boxes match.",
    "e73095fd.json": "Input Description: In the input, you should see...grey lines connecting nodes on a black background\n\nOutput Grid Size Description: The output grid size...is the same as the input\n\nOutput Transformation Description: To make the output, you have to...fill the nodes with yellow.",
    "e76a88a6.json": "Input Description: In the input, you should see... 10x10 grid\n\nOutput Grid Size Description: The output grid size... 10x10 grid\n\nOutput Transformation Description: To make the output, you have to...copy the color pattern into the other gray shapes.",
    "e8593010.json": "Input Description: In the input, you should see... a grey grid with some black squares\n\nOutput Grid Size Description: The output grid size... is the same as the input size\n\nOutput Transformation Description: To make the output, you have to... fill any single black squares with green. Fill any two-square black shapes with red. Fill any three-square black shapes with blue. The background remains grey.",
    "e8dc4411.json": "Input Description: In the input, you should see...a black pattern on a colored grid with one colored block next to it.\n\nOutput Grid Size Description: The output grid size...is the same.\n\nOutput Transformation Description: To make the output, you have to...copy the black pattern, in whatever the color of the space is next to it, diagonally all the way to the edge of the grid. All other colors stay the same.",
    "e9614598.json": "Input Description: In the input, you should see...a 10x10 grid with two blue squares\n\nOutput Grid Size Description: The output grid size...the same size as the input grid and the blue squares are in the same spots (copy it over)\n\nOutput Transformation Description: To make the output, you have to...imagine the line that would be formed by the blue squares and fill in the middle square with green. Then using the green square as a starting place fill in the block above, below, and on each side with green. It should look like a plus sign.",
    "e98196ab.json": "Input Description: In the input, you should see...11x11 grid split into two 5x11 grids through a solid color row in the middle\n\nOutput Grid Size Description: The output grid size... 5x11grid\n\nOutput Transformation Description: To make the output, you have to... mesh together both patterns above and below the solid color row into one 5x11 grid",
    "e9afcf9a.json": "Input Description: In the input, you should see... like it\n\nOutput Grid Size Description: The output grid size... good\n\nOutput Transformation Description: To make the output, you have to... nice",
    "ea32f347.json": "Input Description: In the input, you should see...three gray lines of differing lengths on a black background\n\nOutput Grid Size Description: The output grid size...is the same as the input grid.\n\nOutput Transformation Description: To make the output, you have to...change the color of the lines. The longest line needs to be colored blue. The middle length line needs to be colored yellow. The shortest line needs to be colored red.",
    "ea786f4a.json": "Input Description: In the input, you should see... A square with a dominant surrounding color and a black tile in the middle\n\nOutput Grid Size Description: The output grid size... remains the same as the input size\n\nOutput Transformation Description: To make the output, you have to... Create an X by filling in the diagonal tiles until the edge of each corner is reached",
    "eb281b96.json": "Input Description: In the input, you should see...a 3x17 or 4x17 pattern\n\nOutput Grid Size Description: The output grid size...is the same horizontally and multiplied by 3 vertically (and add 1)\n\nOutput Transformation Description: To make the output, you have to...flip the pattern vertically 3 times to create a continuous pattern that is symmetrical both vertically and horizontally",
    "eb5a1d5d.json": "Input Description: In the input, you should see... one color inside another. you might have a third or 4th color .\n\nOutput Grid Size Description: The output grid size...if 2 color 3x3, if 3 color 5x5 if 4 color 7x7\n\nOutput Transformation Description: To make the output, you have to...the color all the way inside is 1x1 in the center. the next color is 3x3 in the center (other than the 1x1 from before). If you have a third color, the center 5x5 is that and finally the 4th color is the far 7x7 edge.",
    "ec883f72.json": "Input Description: In the input, you should see...a square within another square that is a different color.\n\nOutput Grid Size Description: The output grid size...is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to...Add diagonal lines from the corner of the larger box to the end of the grid, using the color of the inner box.",
    "ecdecbb3.json": "Input Description: In the input, you should see....A grid with lines of x color and dots of y color.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid\n\nOutput Transformation Description: To make the output, you have to...Copy the input grid. Make perpendicular lines from the dots of y color to touch the closest lines of x color.  The point of touch should be the y color. If the dot of y color is between 2 lines of y color you should make one lines of y color going through the dot of y color and connecting the lines of x colors. Surround each dot of y color (point of touch) on the line of x color with a square of x color. It should be a square of x color with the center of y color on the line of x color. Done.",
    "ed36ccf7.json": "Input Description: In the input, you should see...a 3x3 grid with a shape\n\nOutput Grid Size Description: The output grid size...is the same as the old one\n\nOutput Transformation Description: To make the output, you have to...rotate the shape 90 degrees to the left",
    "ef135b50.json": "Input Description: In the input, you should see...Red squares on a black background\n\nOutput Grid Size Description: The output grid size...is the same\n\nOutput Transformation Description: To make the output, you have to...put dark red squares in between the space that the light red squares  across from each other only left to right squares",
    "f15e1fac.json": "Input Description: In the input, you should see...a many black grid with a few red squares and blue squares\n\nOutput Grid Size Description: The output grid size...the output grid is the same size\n\nOutput Transformation Description: To make the output, you have to...copy the original grid. Imagine, but do not make, that the red blocks are actually parallel lines of red blocks Then for each blue square actually draw a line of blue squares as if you want the blue line to intersect the imaginary red line, but stop above where that line would be. Then for each blue line move one square over, or up or down, away from the original red block. Then, beginning in the place where the imaginary red line is draw another blue line in the same direction until you are above the next imaginary red line. Continue the pattern until you have reach the end of the grid. It should look like you are trying to draw a series of diagonal lines on grid paper",
    "f1cefba8.json": "Input Description: In the input, you should see...a square with a inner color and a differently colored border. The border will have areas of protrusions from the inner color.\n\nOutput Grid Size Description: The output grid size...is the same as the input.\n\nOutput Transformation Description: To make the output, you have to...copy the input grid. Then locate the areas of the border with the inner color protruding into the border. If the protrusion happens along the right or left border then replace every grid in that row with the same color as the border color unless it is a black grid, in the case that it is a black grid, replace that grid with the color of the inner square instead. If the protrusion happens along the top or bottom border, then replace every grid in that column with the same color as the border unless it was previously a black grid. In the case it was a black grid, replace it with the color of the inner color.",
    "f25fbde4.json": "Input Description: In the input, you should see... a yellow shape with a black background\n\nOutput Grid Size Description: The output grid size... copy the yellow shape, then make the grid twice as big (example: 3x3 to 6x6)\n\nOutput Transformation Description: To make the output, you have to... create the input shape again, just twice the size in the bigger grid",
    "f25ffba3.json": "Input Description: In the input, you should see...a black grid with a color pattern\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...reflect the pattern upside down like it was up against a mirror",
    "f2829549.json": "Input Description: In the input, you should see... A random pattern of orange, then one row of blue, and then a random pattern of grey\n\nOutput Grid Size Description: The output grid size... Change the output grid size to 4x3\n\nOutput Transformation Description: To make the output, you have to... Combine the patterns of the orange and grey into one pattern (it doesn't matter if they overlap, just combine them into one pattern) These patterns always take up a space of 4x3! With the combined pattern, fill each empty black space with green, and then fill the rest of the spaces from the old pattern black. There should only be a random green pattern created when done.",
    "f35d900a.json": "Input Description: In the input, you should see... black background with two grids of the same color and another two grids of a different color.\n\nOutput Grid Size Description: The output grid size... is the same as the input grid size.\n\nOutput Transformation Description: To make the output, you have to... First, copy the input grid. Next, identify the colors of the colored grids - we will call it color A and color B. Around the grids with color A, create a 3x3 square with color B, surrounding the color A grids. Around the grids with color B, create a 3x3 square with color A, surrounding the color B grids. Now you should have four 3x3 squares, in which two squares are A color with B colored grid in their centers and two B colored squares with A colored grid in their centers. Next, you have to link the squares with each other by creating grey grids and black grids alternately between each square, starting at the first column or first row right next to each square's side's middle grid.",
    "f5b8619d.json": "Input Description: In the input, you should see... some colored squares\n\nOutput Grid Size Description: The output grid size... is times two of what ever you start with so if you start with a 2 by 2 then the out put would be a 4 by 4\n\nOutput Transformation Description: To make the output, you have to...use the in put grid as 4 sections of the out put so that there is a pattern of the first colored squares, then using light blue make lines up and down from the colored squares to until you reach another colored square or the end of the out put grid",
    "f76d97a5.json": "Input Description: In the input, you should see...color grid in a grey grid\n\nOutput Grid Size Description: The output grid size...same as input\n\nOutput Transformation Description: To make the output, you have to...replace all grey to color and replace other color with black",
    "f8a8fe49.json": "Input Description: In the input, you should see...two patterns. One is orange and the other is gray. The gray pattern should be inside of the orange one.\n\nOutput Grid Size Description: The output grid size...is the same\n\nOutput Transformation Description: To make the output, you have to...flip the grey pattern over the red one like an mirror image. The resulting output should now have the grey pattern outside of the orange one.",
    "f8b3ba0a.json": "Input Description: In the input, you should see...multiple color boxes are  shown. each color are combine with same color.\n\nOutput Grid Size Description: The output grid size...reduce the grid size vertically like 1x3, 1x4 subject to the number of color and avoid a color box shown in large number.\n\nOutput Transformation Description: To make the output, you have to...order the color boxes. avoid a large number of the color box.",
    "f8c80d96.json": "Input Description: In the input, you should see... a part of a spiral, each line with the same spacing from the last.\n\nOutput Grid Size Description: The output grid size... stays the same.\n\nOutput Transformation Description: To make the output, you have to... change the background color from black to light gray, then continue the pattern of lines, with the same spacing and bends.",
    "f8ff0b80.json": "Input Description: In the input, you should see...3 colors in random order\n\nOutput Grid Size Description: The output grid size...is only 3 squares placed vertically\n\nOutput Transformation Description: To make the output, you have to...Place the colors in order from most to least. For example the color that has the most squares should be the top square color in the output. You then just go down from there. Second most color will go below that.",
    "f9012d9b.json": "Input Description: In the input, you should see...you should see a grid with a two color pattern and a black square in place of part of that pattern.\n\nOutput Grid Size Description: The output grid size...should be the same size and shape as the black square.\n\nOutput Transformation Description: To make the output, you have to...fill in the grid so you that you finish the colored pattern that should go where the black squares are located.",
    "fafffa47.json": "Input Description: In the input, you should see...6x3 grid with brown and blue squares\n\nOutput Grid Size Description: The output grid size...is 3x3 grid\n\nOutput Transformation Description: To make the output, you have to... first, create a 3x3 grid and flood fill it with black color. Next, copy the brown pattern to the 3x3 grid. Then, copy the blue pattern on top of the brown pattern. After that, fill in the black squares with red color and fill in all the brown and blue squares with black color.",
    "fcb5c309.json": "Input Description: In the input, you should see...A black grid with colored shapes and randomly placed pixels of a third color.\n\nOutput Grid Size Description: The output grid size...should be the same size as the largest colored shape.\n\nOutput Transformation Description: To make the output, you have to...recreate the largest shape from the input, instead using the color of the random pixels from the input.Using that same color, fill in any random pixels that occured in the shape in the input, in the same position they are in in the input shape.",
    "fcc82909.json": "Input Description: In the input, you should see....2x2 squares\n\nOutput Grid Size Description: The output grid size...remains the same as the input.\n\nOutput Transformation Description: To make the output, you have to...copy the input and add a green rectangle 2 pixels wide and as many rows high as there are colors in the square below each square.",
    "feca6190.json": "Input Description: In the input, you should see...five multi-colored squares in a horizontal row.\n\nOutput Grid Size Description: The output grid size... the height and width are = to [5 * (the number of colored blocks)], so if there are 3 colored blocks, the grid is 15x15, if there are 2 colored blocks, the grid is 10x10, if there is only one colored block, the grid is 5x5.\n\nOutput Transformation Description: To make the output, you have to...copy the input. Starting from the bottom left of the output grid, paste the input. Go back to the bottom left, move up one block and to the right one block, paste the input again. Go back to the bottom left, move up two blocks and right two blocks, paste the input again. Repeat this pattern until the leftmost square of the input grid is in the top right corner of the output grid. It will look like a diagonal pattern.",
    "ff28f65a.json": "Input Description: In the input, you should see... a series of 2x2 red squares.\n\nOutput Grid Size Description: The output grid size...is 5x5 (all black).\n\nOutput Transformation Description: To make the output, you have to...Make a 5x5 black output grid. Then count how many 2x2 red  squares there are in the input. That is how many squares you will fill in the output with dark blue (not light blue). You will fill in the blue squares every other square, starting in the top left (example: If there are 2 2x2 red squares in the input, you would fill in the top left and top right of your 3x3 output with dark blue. If there are 3 2x2 red squares in your input, you would fill in the top left, top right, and middle middle squares with dark blue. So, always alternate, even when you move to a lower row of your output - there should never be two blues in a row or a blue directly underneath of another one. Whatever squares you don't fill in with dark blue should stay black",
    "ff805c23.json": "Input Description: In the input, you should see...a pattern with a blue square in it\n\nOutput Grid Size Description: The output grid size...is the same size as the blue square\n\nOutput Transformation Description: To make the output, you have to...fill the blue square with the missing piece of the pattern from the input grid, using the same colors."
}